MikroElektronika/core_packages/PIC/XC8/def/PIC18LF45K80/mcu.h
extern volatile RXF7EIDHbits_t RXF7EIDHbits __at(0xE4E);
// bitfield macros
#define _RXF7EIDH_EID_POSN                                  0x0
#define _RXF7EIDH_EID_POSITION                              0x0
#define _RXF7EIDH_EID_SIZE                                  0x8
#define _RXF7EIDH_EID_LENGTH                                0x8
#define _RXF7EIDH_EID_MASK                                  0xFF
#define _RXF7EIDH_EID8_POSN                                 0x0
#define _RXF7EIDH_EID8_POSITION                             0x0
#define _RXF7EIDH_EID8_SIZE                                 0x1
#define _RXF7EIDH_EID8_LENGTH                               0x1
#define _RXF7EIDH_EID8_MASK                                 0x1
#define _RXF7EIDH_EID9_POSN                                 0x1
#define _RXF7EIDH_EID9_POSITION                             0x1
#define _RXF7EIDH_EID9_SIZE                                 0x1
#define _RXF7EIDH_EID9_LENGTH                               0x1
#define _RXF7EIDH_EID9_MASK                                 0x2
#define _RXF7EIDH_EID10_POSN                                0x2
#define _RXF7EIDH_EID10_POSITION                            0x2
#define _RXF7EIDH_EID10_SIZE                                0x1
#define _RXF7EIDH_EID10_LENGTH                              0x1
#define _RXF7EIDH_EID10_MASK                                0x4
#define _RXF7EIDH_EID11_POSN                                0x3
#define _RXF7EIDH_EID11_POSITION                            0x3
#define _RXF7EIDH_EID11_SIZE                                0x1
#define _RXF7EIDH_EID11_LENGTH                              0x1
#define _RXF7EIDH_EID11_MASK                                0x8
#define _RXF7EIDH_EID12_POSN                                0x4
#define _RXF7EIDH_EID12_POSITION                            0x4
#define _RXF7EIDH_EID12_SIZE                                0x1
#define _RXF7EIDH_EID12_LENGTH                              0x1
#define _RXF7EIDH_EID12_MASK                                0x10
#define _RXF7EIDH_EID13_POSN                                0x5
#define _RXF7EIDH_EID13_POSITION                            0x5
#define _RXF7EIDH_EID13_SIZE                                0x1
#define _RXF7EIDH_EID13_LENGTH                              0x1
#define _RXF7EIDH_EID13_MASK                                0x20
#define _RXF7EIDH_EID14_POSN                                0x6
#define _RXF7EIDH_EID14_POSITION                            0x6
#define _RXF7EIDH_EID14_SIZE                                0x1
#define _RXF7EIDH_EID14_LENGTH                              0x1
#define _RXF7EIDH_EID14_MASK                                0x40
#define _RXF7EIDH_EID15_POSN                                0x7
#define _RXF7EIDH_EID15_POSITION                            0x7
#define _RXF7EIDH_EID15_SIZE                                0x1
#define _RXF7EIDH_EID15_LENGTH                              0x1
#define _RXF7EIDH_EID15_MASK                                0x80
#define _RXF7EIDH_RXF7EID8_POSN                             0x0
#define _RXF7EIDH_RXF7EID8_POSITION                         0x0
#define _RXF7EIDH_RXF7EID8_SIZE                             0x1
#define _RXF7EIDH_RXF7EID8_LENGTH                           0x1
#define _RXF7EIDH_RXF7EID8_MASK                             0x1
#define _RXF7EIDH_RXF7EID9_POSN                             0x1
#define _RXF7EIDH_RXF7EID9_POSITION                         0x1
#define _RXF7EIDH_RXF7EID9_SIZE                             0x1
#define _RXF7EIDH_RXF7EID9_LENGTH                           0x1
#define _RXF7EIDH_RXF7EID9_MASK                             0x2
#define _RXF7EIDH_RXF7EID10_POSN                            0x2
#define _RXF7EIDH_RXF7EID10_POSITION                        0x2
#define _RXF7EIDH_RXF7EID10_SIZE                            0x1
#define _RXF7EIDH_RXF7EID10_LENGTH                          0x1
#define _RXF7EIDH_RXF7EID10_MASK                            0x4
#define _RXF7EIDH_RXF7EID11_POSN                            0x3
#define _RXF7EIDH_RXF7EID11_POSITION                        0x3
#define _RXF7EIDH_RXF7EID11_SIZE                            0x1
#define _RXF7EIDH_RXF7EID11_LENGTH                          0x1
#define _RXF7EIDH_RXF7EID11_MASK                            0x8
#define _RXF7EIDH_RXF7EID12_POSN                            0x4
#define _RXF7EIDH_RXF7EID12_POSITION                        0x4
#define _RXF7EIDH_RXF7EID12_SIZE                            0x1
#define _RXF7EIDH_RXF7EID12_LENGTH                          0x1
#define _RXF7EIDH_RXF7EID12_MASK                            0x10
#define _RXF7EIDH_RXF7EID13_POSN                            0x5
#define _RXF7EIDH_RXF7EID13_POSITION                        0x5
#define _RXF7EIDH_RXF7EID13_SIZE                            0x1
#define _RXF7EIDH_RXF7EID13_LENGTH                          0x1
#define _RXF7EIDH_RXF7EID13_MASK                            0x20
#define _RXF7EIDH_RXF7EID14_POSN                            0x6
#define _RXF7EIDH_RXF7EID14_POSITION                        0x6
#define _RXF7EIDH_RXF7EID14_SIZE                            0x1
#define _RXF7EIDH_RXF7EID14_LENGTH                          0x1
#define _RXF7EIDH_RXF7EID14_MASK                            0x40
#define _RXF7EIDH_RXF7EID15_POSN                            0x7
#define _RXF7EIDH_RXF7EID15_POSITION                        0x7
#define _RXF7EIDH_RXF7EID15_SIZE                            0x1
#define _RXF7EIDH_RXF7EID15_LENGTH                          0x1
#define _RXF7EIDH_RXF7EID15_MASK                            0x80

// Register: RXF7EIDL
#define RXF7EIDL RXF7EIDL
extern volatile unsigned char           RXF7EIDL            __at(0xE4F);
#ifndef _LIB_BUILD
asm("RXF7EIDL equ 0E4Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF7EID0               :1;
        unsigned RXF7EID1               :1;
        unsigned RXF7EID2               :1;
        unsigned RXF7EID3               :1;
        unsigned RXF7EID4               :1;
        unsigned RXF7EID5               :1;
        unsigned RXF7EID6               :1;
        unsigned RXF7EID7               :1;
    };
} RXF7EIDLbits_t;
extern volatile RXF7EIDLbits_t RXF7EIDLbits __at(0xE4F);
// bitfield macros
#define _RXF7EIDL_EID_POSN                                  0x0
#define _RXF7EIDL_EID_POSITION                              0x0
#define _RXF7EIDL_EID_SIZE                                  0x8
#define _RXF7EIDL_EID_LENGTH                                0x8
#define _RXF7EIDL_EID_MASK                                  0xFF
#define _RXF7EIDL_EID0_POSN                                 0x0
#define _RXF7EIDL_EID0_POSITION                             0x0
#define _RXF7EIDL_EID0_SIZE                                 0x1
#define _RXF7EIDL_EID0_LENGTH                               0x1
#define _RXF7EIDL_EID0_MASK                                 0x1
#define _RXF7EIDL_EID1_POSN                                 0x1
#define _RXF7EIDL_EID1_POSITION                             0x1
#define _RXF7EIDL_EID1_SIZE                                 0x1
#define _RXF7EIDL_EID1_LENGTH                               0x1
#define _RXF7EIDL_EID1_MASK                                 0x2
#define _RXF7EIDL_EID2_POSN                                 0x2
#define _RXF7EIDL_EID2_POSITION                             0x2
#define _RXF7EIDL_EID2_SIZE                                 0x1
#define _RXF7EIDL_EID2_LENGTH                               0x1
#define _RXF7EIDL_EID2_MASK                                 0x4
#define _RXF7EIDL_EID3_POSN                                 0x3
#define _RXF7EIDL_EID3_POSITION                             0x3
#define _RXF7EIDL_EID3_SIZE                                 0x1
#define _RXF7EIDL_EID3_LENGTH                               0x1
#define _RXF7EIDL_EID3_MASK                                 0x8
#define _RXF7EIDL_EID4_POSN                                 0x4
#define _RXF7EIDL_EID4_POSITION                             0x4
#define _RXF7EIDL_EID4_SIZE                                 0x1
#define _RXF7EIDL_EID4_LENGTH                               0x1
#define _RXF7EIDL_EID4_MASK                                 0x10
#define _RXF7EIDL_EID5_POSN                                 0x5
#define _RXF7EIDL_EID5_POSITION                             0x5
#define _RXF7EIDL_EID5_SIZE                                 0x1
#define _RXF7EIDL_EID5_LENGTH                               0x1
#define _RXF7EIDL_EID5_MASK                                 0x20
#define _RXF7EIDL_EID6_POSN                                 0x6
#define _RXF7EIDL_EID6_POSITION                             0x6
#define _RXF7EIDL_EID6_SIZE                                 0x1
#define _RXF7EIDL_EID6_LENGTH                               0x1
#define _RXF7EIDL_EID6_MASK                                 0x40
#define _RXF7EIDL_EID7_POSN                                 0x7
#define _RXF7EIDL_EID7_POSITION                             0x7
#define _RXF7EIDL_EID7_SIZE                                 0x1
#define _RXF7EIDL_EID7_LENGTH                               0x1
#define _RXF7EIDL_EID7_MASK                                 0x80
#define _RXF7EIDL_RXF7EID0_POSN                             0x0
#define _RXF7EIDL_RXF7EID0_POSITION                         0x0
#define _RXF7EIDL_RXF7EID0_SIZE                             0x1
#define _RXF7EIDL_RXF7EID0_LENGTH                           0x1
#define _RXF7EIDL_RXF7EID0_MASK                             0x1
#define _RXF7EIDL_RXF7EID1_POSN                             0x1
#define _RXF7EIDL_RXF7EID1_POSITION                         0x1
#define _RXF7EIDL_RXF7EID1_SIZE                             0x1
#define _RXF7EIDL_RXF7EID1_LENGTH                           0x1
#define _RXF7EIDL_RXF7EID1_MASK                             0x2
#define _RXF7EIDL_RXF7EID2_POSN                             0x2
#define _RXF7EIDL_RXF7EID2_POSITION                         0x2
#define _RXF7EIDL_RXF7EID2_SIZE                             0x1
#define _RXF7EIDL_RXF7EID2_LENGTH                           0x1
#define _RXF7EIDL_RXF7EID2_MASK                             0x4
#define _RXF7EIDL_RXF7EID3_POSN                             0x3
#define _RXF7EIDL_RXF7EID3_POSITION                         0x3
#define _RXF7EIDL_RXF7EID3_SIZE                             0x1
#define _RXF7EIDL_RXF7EID3_LENGTH                           0x1
#define _RXF7EIDL_RXF7EID3_MASK                             0x8
#define _RXF7EIDL_RXF7EID4_POSN                             0x4
#define _RXF7EIDL_RXF7EID4_POSITION                         0x4
#define _RXF7EIDL_RXF7EID4_SIZE                             0x1
#define _RXF7EIDL_RXF7EID4_LENGTH                           0x1
#define _RXF7EIDL_RXF7EID4_MASK                             0x10
#define _RXF7EIDL_RXF7EID5_POSN                             0x5
#define _RXF7EIDL_RXF7EID5_POSITION                         0x5
#define _RXF7EIDL_RXF7EID5_SIZE                             0x1
#define _RXF7EIDL_RXF7EID5_LENGTH                           0x1
#define _RXF7EIDL_RXF7EID5_MASK                             0x20
#define _RXF7EIDL_RXF7EID6_POSN                             0x6
#define _RXF7EIDL_RXF7EID6_POSITION                         0x6
#define _RXF7EIDL_RXF7EID6_SIZE                             0x1
#define _RXF7EIDL_RXF7EID6_LENGTH                           0x1
#define _RXF7EIDL_RXF7EID6_MASK                             0x40
#define _RXF7EIDL_RXF7EID7_POSN                             0x7
#define _RXF7EIDL_RXF7EID7_POSITION                         0x7
#define _RXF7EIDL_RXF7EID7_SIZE                             0x1
#define _RXF7EIDL_RXF7EID7_LENGTH                           0x1
#define _RXF7EIDL_RXF7EID7_MASK                             0x80

// Register: RXF8SIDH
#define RXF8SIDH RXF8SIDH
extern volatile unsigned char           RXF8SIDH            __at(0xE50);
#ifndef _LIB_BUILD
asm("RXF8SIDH equ 0E50h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID                    :8;
    };
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXF8SID3               :1;
        unsigned RXF8SID4               :1;
        unsigned RXF8SID5               :1;
        unsigned RXF8SID6               :1;
        unsigned RXF8SID7               :1;
        unsigned RXF8SID8               :1;
        unsigned RXF8SID9               :1;
        unsigned RXF8SID10              :1;
    };
} RXF8SIDHbits_t;
