MikroElektronika/core_packages/PIC/XC8/def/PIC18LF45K80/mcu.h
extern volatile RXF8SIDHbits_t RXF8SIDHbits __at(0xE50);
// bitfield macros
#define _RXF8SIDH_SID_POSN                                  0x0
#define _RXF8SIDH_SID_POSITION                              0x0
#define _RXF8SIDH_SID_SIZE                                  0x8
#define _RXF8SIDH_SID_LENGTH                                0x8
#define _RXF8SIDH_SID_MASK                                  0xFF
#define _RXF8SIDH_SID3_POSN                                 0x0
#define _RXF8SIDH_SID3_POSITION                             0x0
#define _RXF8SIDH_SID3_SIZE                                 0x1
#define _RXF8SIDH_SID3_LENGTH                               0x1
#define _RXF8SIDH_SID3_MASK                                 0x1
#define _RXF8SIDH_SID4_POSN                                 0x1
#define _RXF8SIDH_SID4_POSITION                             0x1
#define _RXF8SIDH_SID4_SIZE                                 0x1
#define _RXF8SIDH_SID4_LENGTH                               0x1
#define _RXF8SIDH_SID4_MASK                                 0x2
#define _RXF8SIDH_SID5_POSN                                 0x2
#define _RXF8SIDH_SID5_POSITION                             0x2
#define _RXF8SIDH_SID5_SIZE                                 0x1
#define _RXF8SIDH_SID5_LENGTH                               0x1
#define _RXF8SIDH_SID5_MASK                                 0x4
#define _RXF8SIDH_SID6_POSN                                 0x3
#define _RXF8SIDH_SID6_POSITION                             0x3
#define _RXF8SIDH_SID6_SIZE                                 0x1
#define _RXF8SIDH_SID6_LENGTH                               0x1
#define _RXF8SIDH_SID6_MASK                                 0x8
#define _RXF8SIDH_SID7_POSN                                 0x4
#define _RXF8SIDH_SID7_POSITION                             0x4
#define _RXF8SIDH_SID7_SIZE                                 0x1
#define _RXF8SIDH_SID7_LENGTH                               0x1
#define _RXF8SIDH_SID7_MASK                                 0x10
#define _RXF8SIDH_SID8_POSN                                 0x5
#define _RXF8SIDH_SID8_POSITION                             0x5
#define _RXF8SIDH_SID8_SIZE                                 0x1
#define _RXF8SIDH_SID8_LENGTH                               0x1
#define _RXF8SIDH_SID8_MASK                                 0x20
#define _RXF8SIDH_SID9_POSN                                 0x6
#define _RXF8SIDH_SID9_POSITION                             0x6
#define _RXF8SIDH_SID9_SIZE                                 0x1
#define _RXF8SIDH_SID9_LENGTH                               0x1
#define _RXF8SIDH_SID9_MASK                                 0x40
#define _RXF8SIDH_SID10_POSN                                0x7
#define _RXF8SIDH_SID10_POSITION                            0x7
#define _RXF8SIDH_SID10_SIZE                                0x1
#define _RXF8SIDH_SID10_LENGTH                              0x1
#define _RXF8SIDH_SID10_MASK                                0x80
#define _RXF8SIDH_RXF8SID3_POSN                             0x0
#define _RXF8SIDH_RXF8SID3_POSITION                         0x0
#define _RXF8SIDH_RXF8SID3_SIZE                             0x1
#define _RXF8SIDH_RXF8SID3_LENGTH                           0x1
#define _RXF8SIDH_RXF8SID3_MASK                             0x1
#define _RXF8SIDH_RXF8SID4_POSN                             0x1
#define _RXF8SIDH_RXF8SID4_POSITION                         0x1
#define _RXF8SIDH_RXF8SID4_SIZE                             0x1
#define _RXF8SIDH_RXF8SID4_LENGTH                           0x1
#define _RXF8SIDH_RXF8SID4_MASK                             0x2
#define _RXF8SIDH_RXF8SID5_POSN                             0x2
#define _RXF8SIDH_RXF8SID5_POSITION                         0x2
#define _RXF8SIDH_RXF8SID5_SIZE                             0x1
#define _RXF8SIDH_RXF8SID5_LENGTH                           0x1
#define _RXF8SIDH_RXF8SID5_MASK                             0x4
#define _RXF8SIDH_RXF8SID6_POSN                             0x3
#define _RXF8SIDH_RXF8SID6_POSITION                         0x3
#define _RXF8SIDH_RXF8SID6_SIZE                             0x1
#define _RXF8SIDH_RXF8SID6_LENGTH                           0x1
#define _RXF8SIDH_RXF8SID6_MASK                             0x8
#define _RXF8SIDH_RXF8SID7_POSN                             0x4
#define _RXF8SIDH_RXF8SID7_POSITION                         0x4
#define _RXF8SIDH_RXF8SID7_SIZE                             0x1
#define _RXF8SIDH_RXF8SID7_LENGTH                           0x1
#define _RXF8SIDH_RXF8SID7_MASK                             0x10
#define _RXF8SIDH_RXF8SID8_POSN                             0x5
#define _RXF8SIDH_RXF8SID8_POSITION                         0x5
#define _RXF8SIDH_RXF8SID8_SIZE                             0x1
#define _RXF8SIDH_RXF8SID8_LENGTH                           0x1
#define _RXF8SIDH_RXF8SID8_MASK                             0x20
#define _RXF8SIDH_RXF8SID9_POSN                             0x6
#define _RXF8SIDH_RXF8SID9_POSITION                         0x6
#define _RXF8SIDH_RXF8SID9_SIZE                             0x1
#define _RXF8SIDH_RXF8SID9_LENGTH                           0x1
#define _RXF8SIDH_RXF8SID9_MASK                             0x40
#define _RXF8SIDH_RXF8SID10_POSN                            0x7
#define _RXF8SIDH_RXF8SID10_POSITION                        0x7
#define _RXF8SIDH_RXF8SID10_SIZE                            0x1
#define _RXF8SIDH_RXF8SID10_LENGTH                          0x1
#define _RXF8SIDH_RXF8SID10_MASK                            0x80

// Register: RXF8SIDL
#define RXF8SIDL RXF8SIDL
extern volatile unsigned char           RXF8SIDL            __at(0xE51);
#ifndef _LIB_BUILD
asm("RXF8SIDL equ 0E51h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :2;
        unsigned                        :1;
        unsigned EXIDEN                 :1;
        unsigned                        :1;
        unsigned SID                    :3;
    };
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :3;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned RXF8EID16              :1;
        unsigned RXF8EID17              :1;
        unsigned                        :1;
        unsigned RXF8EXIDEN             :1;
        unsigned                        :1;
        unsigned RXF8SID0               :1;
        unsigned RXF8SID1               :1;
        unsigned RXF8SID2               :1;
    };
} RXF8SIDLbits_t;
extern volatile RXF8SIDLbits_t RXF8SIDLbits __at(0xE51);
// bitfield macros
#define _RXF8SIDL_EID_POSN                                  0x0
#define _RXF8SIDL_EID_POSITION                              0x0
#define _RXF8SIDL_EID_SIZE                                  0x2
#define _RXF8SIDL_EID_LENGTH                                0x2
#define _RXF8SIDL_EID_MASK                                  0x3
#define _RXF8SIDL_EXIDEN_POSN                               0x3
#define _RXF8SIDL_EXIDEN_POSITION                           0x3
#define _RXF8SIDL_EXIDEN_SIZE                               0x1
#define _RXF8SIDL_EXIDEN_LENGTH                             0x1
#define _RXF8SIDL_EXIDEN_MASK                               0x8
#define _RXF8SIDL_SID_POSN                                  0x5
#define _RXF8SIDL_SID_POSITION                              0x5
#define _RXF8SIDL_SID_SIZE                                  0x3
#define _RXF8SIDL_SID_LENGTH                                0x3
#define _RXF8SIDL_SID_MASK                                  0xE0
#define _RXF8SIDL_EID16_POSN                                0x0
#define _RXF8SIDL_EID16_POSITION                            0x0
#define _RXF8SIDL_EID16_SIZE                                0x1
#define _RXF8SIDL_EID16_LENGTH                              0x1
#define _RXF8SIDL_EID16_MASK                                0x1
#define _RXF8SIDL_EID17_POSN                                0x1
#define _RXF8SIDL_EID17_POSITION                            0x1
#define _RXF8SIDL_EID17_SIZE                                0x1
#define _RXF8SIDL_EID17_LENGTH                              0x1
#define _RXF8SIDL_EID17_MASK                                0x2
#define _RXF8SIDL_SID0_POSN                                 0x5
#define _RXF8SIDL_SID0_POSITION                             0x5
#define _RXF8SIDL_SID0_SIZE                                 0x1
#define _RXF8SIDL_SID0_LENGTH                               0x1
#define _RXF8SIDL_SID0_MASK                                 0x20
#define _RXF8SIDL_SID1_POSN                                 0x6
#define _RXF8SIDL_SID1_POSITION                             0x6
#define _RXF8SIDL_SID1_SIZE                                 0x1
#define _RXF8SIDL_SID1_LENGTH                               0x1
#define _RXF8SIDL_SID1_MASK                                 0x40
#define _RXF8SIDL_SID2_POSN                                 0x7
#define _RXF8SIDL_SID2_POSITION                             0x7
#define _RXF8SIDL_SID2_SIZE                                 0x1
#define _RXF8SIDL_SID2_LENGTH                               0x1
#define _RXF8SIDL_SID2_MASK                                 0x80
#define _RXF8SIDL_RXF8EID16_POSN                            0x0
#define _RXF8SIDL_RXF8EID16_POSITION                        0x0
#define _RXF8SIDL_RXF8EID16_SIZE                            0x1
#define _RXF8SIDL_RXF8EID16_LENGTH                          0x1
#define _RXF8SIDL_RXF8EID16_MASK                            0x1
#define _RXF8SIDL_RXF8EID17_POSN                            0x1
#define _RXF8SIDL_RXF8EID17_POSITION                        0x1
#define _RXF8SIDL_RXF8EID17_SIZE                            0x1
#define _RXF8SIDL_RXF8EID17_LENGTH                          0x1
#define _RXF8SIDL_RXF8EID17_MASK                            0x2
#define _RXF8SIDL_RXF8EXIDEN_POSN                           0x3
#define _RXF8SIDL_RXF8EXIDEN_POSITION                       0x3
#define _RXF8SIDL_RXF8EXIDEN_SIZE                           0x1
#define _RXF8SIDL_RXF8EXIDEN_LENGTH                         0x1
#define _RXF8SIDL_RXF8EXIDEN_MASK                           0x8
#define _RXF8SIDL_RXF8SID0_POSN                             0x5
#define _RXF8SIDL_RXF8SID0_POSITION                         0x5
#define _RXF8SIDL_RXF8SID0_SIZE                             0x1
#define _RXF8SIDL_RXF8SID0_LENGTH                           0x1
#define _RXF8SIDL_RXF8SID0_MASK                             0x20
#define _RXF8SIDL_RXF8SID1_POSN                             0x6
#define _RXF8SIDL_RXF8SID1_POSITION                         0x6
#define _RXF8SIDL_RXF8SID1_SIZE                             0x1
#define _RXF8SIDL_RXF8SID1_LENGTH                           0x1
#define _RXF8SIDL_RXF8SID1_MASK                             0x40
#define _RXF8SIDL_RXF8SID2_POSN                             0x7
#define _RXF8SIDL_RXF8SID2_POSITION                         0x7
#define _RXF8SIDL_RXF8SID2_SIZE                             0x1
#define _RXF8SIDL_RXF8SID2_LENGTH                           0x1
#define _RXF8SIDL_RXF8SID2_MASK                             0x80

// Register: RXF8EIDH
#define RXF8EIDH RXF8EIDH
extern volatile unsigned char           RXF8EIDH            __at(0xE52);
#ifndef _LIB_BUILD
asm("RXF8EIDH equ 0E52h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXF8EID8               :1;
        unsigned RXF8EID9               :1;
        unsigned RXF8EID10              :1;
        unsigned RXF8EID11              :1;
        unsigned RXF8EID12              :1;
        unsigned RXF8EID13              :1;
        unsigned RXF8EID14              :1;
        unsigned RXF8EID15              :1;
    };
} RXF8EIDHbits_t;
