MikroElektronika/core_packages/PIC/XC8/def/PIC18LF45K80/mcu.h
extern volatile RXF8EIDHbits_t RXF8EIDHbits __at(0xE52);
// bitfield macros
#define _RXF8EIDH_EID_POSN                                  0x0
#define _RXF8EIDH_EID_POSITION                              0x0
#define _RXF8EIDH_EID_SIZE                                  0x8
#define _RXF8EIDH_EID_LENGTH                                0x8
#define _RXF8EIDH_EID_MASK                                  0xFF
#define _RXF8EIDH_EID8_POSN                                 0x0
#define _RXF8EIDH_EID8_POSITION                             0x0
#define _RXF8EIDH_EID8_SIZE                                 0x1
#define _RXF8EIDH_EID8_LENGTH                               0x1
#define _RXF8EIDH_EID8_MASK                                 0x1
#define _RXF8EIDH_EID9_POSN                                 0x1
#define _RXF8EIDH_EID9_POSITION                             0x1
#define _RXF8EIDH_EID9_SIZE                                 0x1
#define _RXF8EIDH_EID9_LENGTH                               0x1
#define _RXF8EIDH_EID9_MASK                                 0x2
#define _RXF8EIDH_EID10_POSN                                0x2
#define _RXF8EIDH_EID10_POSITION                            0x2
#define _RXF8EIDH_EID10_SIZE                                0x1
#define _RXF8EIDH_EID10_LENGTH                              0x1
#define _RXF8EIDH_EID10_MASK                                0x4
#define _RXF8EIDH_EID11_POSN                                0x3
#define _RXF8EIDH_EID11_POSITION                            0x3
#define _RXF8EIDH_EID11_SIZE                                0x1
#define _RXF8EIDH_EID11_LENGTH                              0x1
#define _RXF8EIDH_EID11_MASK                                0x8
#define _RXF8EIDH_EID12_POSN                                0x4
#define _RXF8EIDH_EID12_POSITION                            0x4
#define _RXF8EIDH_EID12_SIZE                                0x1
#define _RXF8EIDH_EID12_LENGTH                              0x1
#define _RXF8EIDH_EID12_MASK                                0x10
#define _RXF8EIDH_EID13_POSN                                0x5
#define _RXF8EIDH_EID13_POSITION                            0x5
#define _RXF8EIDH_EID13_SIZE                                0x1
#define _RXF8EIDH_EID13_LENGTH                              0x1
#define _RXF8EIDH_EID13_MASK                                0x20
#define _RXF8EIDH_EID14_POSN                                0x6
#define _RXF8EIDH_EID14_POSITION                            0x6
#define _RXF8EIDH_EID14_SIZE                                0x1
#define _RXF8EIDH_EID14_LENGTH                              0x1
#define _RXF8EIDH_EID14_MASK                                0x40
#define _RXF8EIDH_EID15_POSN                                0x7
#define _RXF8EIDH_EID15_POSITION                            0x7
#define _RXF8EIDH_EID15_SIZE                                0x1
#define _RXF8EIDH_EID15_LENGTH                              0x1
#define _RXF8EIDH_EID15_MASK                                0x80
#define _RXF8EIDH_RXF8EID8_POSN                             0x0
#define _RXF8EIDH_RXF8EID8_POSITION                         0x0
#define _RXF8EIDH_RXF8EID8_SIZE                             0x1
#define _RXF8EIDH_RXF8EID8_LENGTH                           0x1
#define _RXF8EIDH_RXF8EID8_MASK                             0x1
#define _RXF8EIDH_RXF8EID9_POSN                             0x1
#define _RXF8EIDH_RXF8EID9_POSITION                         0x1
#define _RXF8EIDH_RXF8EID9_SIZE                             0x1
#define _RXF8EIDH_RXF8EID9_LENGTH                           0x1
#define _RXF8EIDH_RXF8EID9_MASK                             0x2
#define _RXF8EIDH_RXF8EID10_POSN                            0x2
#define _RXF8EIDH_RXF8EID10_POSITION                        0x2
#define _RXF8EIDH_RXF8EID10_SIZE                            0x1
#define _RXF8EIDH_RXF8EID10_LENGTH                          0x1
#define _RXF8EIDH_RXF8EID10_MASK                            0x4
#define _RXF8EIDH_RXF8EID11_POSN                            0x3
#define _RXF8EIDH_RXF8EID11_POSITION                        0x3
#define _RXF8EIDH_RXF8EID11_SIZE                            0x1
#define _RXF8EIDH_RXF8EID11_LENGTH                          0x1
#define _RXF8EIDH_RXF8EID11_MASK                            0x8
#define _RXF8EIDH_RXF8EID12_POSN                            0x4
#define _RXF8EIDH_RXF8EID12_POSITION                        0x4
#define _RXF8EIDH_RXF8EID12_SIZE                            0x1
#define _RXF8EIDH_RXF8EID12_LENGTH                          0x1
#define _RXF8EIDH_RXF8EID12_MASK                            0x10
#define _RXF8EIDH_RXF8EID13_POSN                            0x5
#define _RXF8EIDH_RXF8EID13_POSITION                        0x5
#define _RXF8EIDH_RXF8EID13_SIZE                            0x1
#define _RXF8EIDH_RXF8EID13_LENGTH                          0x1
#define _RXF8EIDH_RXF8EID13_MASK                            0x20
#define _RXF8EIDH_RXF8EID14_POSN                            0x6
#define _RXF8EIDH_RXF8EID14_POSITION                        0x6
#define _RXF8EIDH_RXF8EID14_SIZE                            0x1
#define _RXF8EIDH_RXF8EID14_LENGTH                          0x1
#define _RXF8EIDH_RXF8EID14_MASK                            0x40
#define _RXF8EIDH_RXF8EID15_POSN                            0x7
#define _RXF8EIDH_RXF8EID15_POSITION                        0x7
#define _RXF8EIDH_RXF8EID15_SIZE                            0x1
#define _RXF8EIDH_RXF8EID15_LENGTH                          0x1
#define _RXF8EIDH_RXF8EID15_MASK                            0x80

// Register: RXF8EIDL
#define RXF8EIDL RXF8EIDL
extern volatile unsigned char           RXF8EIDL            __at(0xE53);
#ifndef _LIB_BUILD
asm("RXF8EIDL equ 0E53h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF8EID0               :1;
        unsigned RXF8EID1               :1;
        unsigned RXF8EID2               :1;
        unsigned RXF8EID3               :1;
        unsigned RXF8EID4               :1;
        unsigned RXF8EID5               :1;
        unsigned RXF8EID6               :1;
        unsigned RXF8EID7               :1;
    };
} RXF8EIDLbits_t;
extern volatile RXF8EIDLbits_t RXF8EIDLbits __at(0xE53);
// bitfield macros
#define _RXF8EIDL_EID_POSN                                  0x0
#define _RXF8EIDL_EID_POSITION                              0x0
#define _RXF8EIDL_EID_SIZE                                  0x8
#define _RXF8EIDL_EID_LENGTH                                0x8
#define _RXF8EIDL_EID_MASK                                  0xFF
#define _RXF8EIDL_EID0_POSN                                 0x0
#define _RXF8EIDL_EID0_POSITION                             0x0
#define _RXF8EIDL_EID0_SIZE                                 0x1
#define _RXF8EIDL_EID0_LENGTH                               0x1
#define _RXF8EIDL_EID0_MASK                                 0x1
#define _RXF8EIDL_EID1_POSN                                 0x1
#define _RXF8EIDL_EID1_POSITION                             0x1
#define _RXF8EIDL_EID1_SIZE                                 0x1
#define _RXF8EIDL_EID1_LENGTH                               0x1
#define _RXF8EIDL_EID1_MASK                                 0x2
#define _RXF8EIDL_EID2_POSN                                 0x2
#define _RXF8EIDL_EID2_POSITION                             0x2
#define _RXF8EIDL_EID2_SIZE                                 0x1
#define _RXF8EIDL_EID2_LENGTH                               0x1
#define _RXF8EIDL_EID2_MASK                                 0x4
#define _RXF8EIDL_EID3_POSN                                 0x3
#define _RXF8EIDL_EID3_POSITION                             0x3
#define _RXF8EIDL_EID3_SIZE                                 0x1
#define _RXF8EIDL_EID3_LENGTH                               0x1
#define _RXF8EIDL_EID3_MASK                                 0x8
#define _RXF8EIDL_EID4_POSN                                 0x4
#define _RXF8EIDL_EID4_POSITION                             0x4
#define _RXF8EIDL_EID4_SIZE                                 0x1
#define _RXF8EIDL_EID4_LENGTH                               0x1
#define _RXF8EIDL_EID4_MASK                                 0x10
#define _RXF8EIDL_EID5_POSN                                 0x5
#define _RXF8EIDL_EID5_POSITION                             0x5
#define _RXF8EIDL_EID5_SIZE                                 0x1
#define _RXF8EIDL_EID5_LENGTH                               0x1
#define _RXF8EIDL_EID5_MASK                                 0x20
#define _RXF8EIDL_EID6_POSN                                 0x6
#define _RXF8EIDL_EID6_POSITION                             0x6
#define _RXF8EIDL_EID6_SIZE                                 0x1
#define _RXF8EIDL_EID6_LENGTH                               0x1
#define _RXF8EIDL_EID6_MASK                                 0x40
#define _RXF8EIDL_EID7_POSN                                 0x7
#define _RXF8EIDL_EID7_POSITION                             0x7
#define _RXF8EIDL_EID7_SIZE                                 0x1
#define _RXF8EIDL_EID7_LENGTH                               0x1
#define _RXF8EIDL_EID7_MASK                                 0x80
#define _RXF8EIDL_RXF8EID0_POSN                             0x0
#define _RXF8EIDL_RXF8EID0_POSITION                         0x0
#define _RXF8EIDL_RXF8EID0_SIZE                             0x1
#define _RXF8EIDL_RXF8EID0_LENGTH                           0x1
#define _RXF8EIDL_RXF8EID0_MASK                             0x1
#define _RXF8EIDL_RXF8EID1_POSN                             0x1
#define _RXF8EIDL_RXF8EID1_POSITION                         0x1
#define _RXF8EIDL_RXF8EID1_SIZE                             0x1
#define _RXF8EIDL_RXF8EID1_LENGTH                           0x1
#define _RXF8EIDL_RXF8EID1_MASK                             0x2
#define _RXF8EIDL_RXF8EID2_POSN                             0x2
#define _RXF8EIDL_RXF8EID2_POSITION                         0x2
#define _RXF8EIDL_RXF8EID2_SIZE                             0x1
#define _RXF8EIDL_RXF8EID2_LENGTH                           0x1
#define _RXF8EIDL_RXF8EID2_MASK                             0x4
#define _RXF8EIDL_RXF8EID3_POSN                             0x3
#define _RXF8EIDL_RXF8EID3_POSITION                         0x3
#define _RXF8EIDL_RXF8EID3_SIZE                             0x1
#define _RXF8EIDL_RXF8EID3_LENGTH                           0x1
#define _RXF8EIDL_RXF8EID3_MASK                             0x8
#define _RXF8EIDL_RXF8EID4_POSN                             0x4
#define _RXF8EIDL_RXF8EID4_POSITION                         0x4
#define _RXF8EIDL_RXF8EID4_SIZE                             0x1
#define _RXF8EIDL_RXF8EID4_LENGTH                           0x1
#define _RXF8EIDL_RXF8EID4_MASK                             0x10
#define _RXF8EIDL_RXF8EID5_POSN                             0x5
#define _RXF8EIDL_RXF8EID5_POSITION                         0x5
#define _RXF8EIDL_RXF8EID5_SIZE                             0x1
#define _RXF8EIDL_RXF8EID5_LENGTH                           0x1
#define _RXF8EIDL_RXF8EID5_MASK                             0x20
#define _RXF8EIDL_RXF8EID6_POSN                             0x6
#define _RXF8EIDL_RXF8EID6_POSITION                         0x6
#define _RXF8EIDL_RXF8EID6_SIZE                             0x1
#define _RXF8EIDL_RXF8EID6_LENGTH                           0x1
#define _RXF8EIDL_RXF8EID6_MASK                             0x40
#define _RXF8EIDL_RXF8EID7_POSN                             0x7
#define _RXF8EIDL_RXF8EID7_POSITION                         0x7
#define _RXF8EIDL_RXF8EID7_SIZE                             0x1
#define _RXF8EIDL_RXF8EID7_LENGTH                           0x1
#define _RXF8EIDL_RXF8EID7_MASK                             0x80

// Register: RXF9SIDH
#define RXF9SIDH RXF9SIDH
extern volatile unsigned char           RXF9SIDH            __at(0xE54);
#ifndef _LIB_BUILD
asm("RXF9SIDH equ 0E54h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID                    :8;
    };
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXF9SID3               :1;
        unsigned RXF9SID4               :1;
        unsigned RXF9SID5               :1;
        unsigned RXF9SID6               :1;
        unsigned RXF9SID7               :1;
        unsigned RXF9SID8               :1;
        unsigned RXF9SID9               :1;
        unsigned RXF9SID10              :1;
    };
} RXF9SIDHbits_t;
extern volatile RXF9SIDHbits_t RXF9SIDHbits __at(0xE54);
// bitfield macros
#define _RXF9SIDH_SID_POSN                                  0x0
#define _RXF9SIDH_SID_POSITION                              0x0
#define _RXF9SIDH_SID_SIZE                                  0x8
#define _RXF9SIDH_SID_LENGTH                                0x8
#define _RXF9SIDH_SID_MASK                                  0xFF
#define _RXF9SIDH_SID3_POSN                                 0x0
#define _RXF9SIDH_SID3_POSITION                             0x0
#define _RXF9SIDH_SID3_SIZE                                 0x1
#define _RXF9SIDH_SID3_LENGTH                               0x1
#define _RXF9SIDH_SID3_MASK                                 0x1
#define _RXF9SIDH_SID4_POSN                                 0x1
#define _RXF9SIDH_SID4_POSITION                             0x1
#define _RXF9SIDH_SID4_SIZE                                 0x1
#define _RXF9SIDH_SID4_LENGTH                               0x1
#define _RXF9SIDH_SID4_MASK                                 0x2
#define _RXF9SIDH_SID5_POSN                                 0x2
#define _RXF9SIDH_SID5_POSITION                             0x2
#define _RXF9SIDH_SID5_SIZE                                 0x1
#define _RXF9SIDH_SID5_LENGTH                               0x1
#define _RXF9SIDH_SID5_MASK                                 0x4
#define _RXF9SIDH_SID6_POSN                                 0x3
#define _RXF9SIDH_SID6_POSITION                             0x3
#define _RXF9SIDH_SID6_SIZE                                 0x1
#define _RXF9SIDH_SID6_LENGTH                               0x1
#define _RXF9SIDH_SID6_MASK                                 0x8
#define _RXF9SIDH_SID7_POSN                                 0x4
#define _RXF9SIDH_SID7_POSITION                             0x4
#define _RXF9SIDH_SID7_SIZE                                 0x1
#define _RXF9SIDH_SID7_LENGTH                               0x1
#define _RXF9SIDH_SID7_MASK                                 0x10
#define _RXF9SIDH_SID8_POSN                                 0x5
#define _RXF9SIDH_SID8_POSITION                             0x5
#define _RXF9SIDH_SID8_SIZE                                 0x1
#define _RXF9SIDH_SID8_LENGTH                               0x1
#define _RXF9SIDH_SID8_MASK                                 0x20
#define _RXF9SIDH_SID9_POSN                                 0x6
#define _RXF9SIDH_SID9_POSITION                             0x6
#define _RXF9SIDH_SID9_SIZE                                 0x1
#define _RXF9SIDH_SID9_LENGTH                               0x1
#define _RXF9SIDH_SID9_MASK                                 0x40
#define _RXF9SIDH_SID10_POSN                                0x7
#define _RXF9SIDH_SID10_POSITION                            0x7
#define _RXF9SIDH_SID10_SIZE                                0x1
#define _RXF9SIDH_SID10_LENGTH                              0x1
#define _RXF9SIDH_SID10_MASK                                0x80
#define _RXF9SIDH_RXF9SID3_POSN                             0x0
#define _RXF9SIDH_RXF9SID3_POSITION                         0x0
#define _RXF9SIDH_RXF9SID3_SIZE                             0x1
#define _RXF9SIDH_RXF9SID3_LENGTH                           0x1
#define _RXF9SIDH_RXF9SID3_MASK                             0x1
#define _RXF9SIDH_RXF9SID4_POSN                             0x1
#define _RXF9SIDH_RXF9SID4_POSITION                         0x1
#define _RXF9SIDH_RXF9SID4_SIZE                             0x1
#define _RXF9SIDH_RXF9SID4_LENGTH                           0x1
#define _RXF9SIDH_RXF9SID4_MASK                             0x2
#define _RXF9SIDH_RXF9SID5_POSN                             0x2
#define _RXF9SIDH_RXF9SID5_POSITION                         0x2
#define _RXF9SIDH_RXF9SID5_SIZE                             0x1
#define _RXF9SIDH_RXF9SID5_LENGTH                           0x1
#define _RXF9SIDH_RXF9SID5_MASK                             0x4
#define _RXF9SIDH_RXF9SID6_POSN                             0x3
#define _RXF9SIDH_RXF9SID6_POSITION                         0x3
#define _RXF9SIDH_RXF9SID6_SIZE                             0x1
#define _RXF9SIDH_RXF9SID6_LENGTH                           0x1
#define _RXF9SIDH_RXF9SID6_MASK                             0x8
#define _RXF9SIDH_RXF9SID7_POSN                             0x4
#define _RXF9SIDH_RXF9SID7_POSITION                         0x4
#define _RXF9SIDH_RXF9SID7_SIZE                             0x1
#define _RXF9SIDH_RXF9SID7_LENGTH                           0x1
#define _RXF9SIDH_RXF9SID7_MASK                             0x10
#define _RXF9SIDH_RXF9SID8_POSN                             0x5
#define _RXF9SIDH_RXF9SID8_POSITION                         0x5
#define _RXF9SIDH_RXF9SID8_SIZE                             0x1
#define _RXF9SIDH_RXF9SID8_LENGTH                           0x1
#define _RXF9SIDH_RXF9SID8_MASK                             0x20
#define _RXF9SIDH_RXF9SID9_POSN                             0x6
#define _RXF9SIDH_RXF9SID9_POSITION                         0x6
#define _RXF9SIDH_RXF9SID9_SIZE                             0x1
#define _RXF9SIDH_RXF9SID9_LENGTH                           0x1
#define _RXF9SIDH_RXF9SID9_MASK                             0x40
#define _RXF9SIDH_RXF9SID10_POSN                            0x7
#define _RXF9SIDH_RXF9SID10_POSITION                        0x7
#define _RXF9SIDH_RXF9SID10_SIZE                            0x1
#define _RXF9SIDH_RXF9SID10_LENGTH                          0x1
#define _RXF9SIDH_RXF9SID10_MASK                            0x80

