MikroElektronika/core_packages/PIC/XC8/def/PIC18LF45K80/mcu.h
// Register: RXFBCON3
#define RXFBCON3 RXFBCON3
extern volatile unsigned char           RXFBCON3            __at(0xE74);
#ifndef _LIB_BUILD
asm("RXFBCON3 equ 0E74h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned F6BP                   :4;
        unsigned F7BP                   :4;
    };
    struct {
        unsigned F6BP_0                 :1;
        unsigned F6BP_1                 :1;
        unsigned F6BP_2                 :1;
        unsigned F6BP_3                 :1;
        unsigned F7BP_0                 :1;
        unsigned F7BP_1                 :1;
        unsigned F7BP_2                 :1;
        unsigned F7BP_3                 :1;
    };
    struct {
        unsigned F6BP_01                :1;
    };
} RXFBCON3bits_t;
extern volatile RXFBCON3bits_t RXFBCON3bits __at(0xE74);
// bitfield macros
#define _RXFBCON3_F6BP_POSN                                 0x0
#define _RXFBCON3_F6BP_POSITION                             0x0
#define _RXFBCON3_F6BP_SIZE                                 0x4
#define _RXFBCON3_F6BP_LENGTH                               0x4
#define _RXFBCON3_F6BP_MASK                                 0xF
#define _RXFBCON3_F7BP_POSN                                 0x4
#define _RXFBCON3_F7BP_POSITION                             0x4
#define _RXFBCON3_F7BP_SIZE                                 0x4
#define _RXFBCON3_F7BP_LENGTH                               0x4
#define _RXFBCON3_F7BP_MASK                                 0xF0
#define _RXFBCON3_F6BP_0_POSN                               0x0
#define _RXFBCON3_F6BP_0_POSITION                           0x0
#define _RXFBCON3_F6BP_0_SIZE                               0x1
#define _RXFBCON3_F6BP_0_LENGTH                             0x1
#define _RXFBCON3_F6BP_0_MASK                               0x1
#define _RXFBCON3_F6BP_1_POSN                               0x1
#define _RXFBCON3_F6BP_1_POSITION                           0x1
#define _RXFBCON3_F6BP_1_SIZE                               0x1
#define _RXFBCON3_F6BP_1_LENGTH                             0x1
#define _RXFBCON3_F6BP_1_MASK                               0x2
#define _RXFBCON3_F6BP_2_POSN                               0x2
#define _RXFBCON3_F6BP_2_POSITION                           0x2
#define _RXFBCON3_F6BP_2_SIZE                               0x1
#define _RXFBCON3_F6BP_2_LENGTH                             0x1
#define _RXFBCON3_F6BP_2_MASK                               0x4
#define _RXFBCON3_F6BP_3_POSN                               0x3
#define _RXFBCON3_F6BP_3_POSITION                           0x3
#define _RXFBCON3_F6BP_3_SIZE                               0x1
#define _RXFBCON3_F6BP_3_LENGTH                             0x1
#define _RXFBCON3_F6BP_3_MASK                               0x8
#define _RXFBCON3_F7BP_0_POSN                               0x4
#define _RXFBCON3_F7BP_0_POSITION                           0x4
#define _RXFBCON3_F7BP_0_SIZE                               0x1
#define _RXFBCON3_F7BP_0_LENGTH                             0x1
#define _RXFBCON3_F7BP_0_MASK                               0x10
#define _RXFBCON3_F7BP_1_POSN                               0x5
#define _RXFBCON3_F7BP_1_POSITION                           0x5
#define _RXFBCON3_F7BP_1_SIZE                               0x1
#define _RXFBCON3_F7BP_1_LENGTH                             0x1
#define _RXFBCON3_F7BP_1_MASK                               0x20
#define _RXFBCON3_F7BP_2_POSN                               0x6
#define _RXFBCON3_F7BP_2_POSITION                           0x6
#define _RXFBCON3_F7BP_2_SIZE                               0x1
#define _RXFBCON3_F7BP_2_LENGTH                             0x1
#define _RXFBCON3_F7BP_2_MASK                               0x40
#define _RXFBCON3_F7BP_3_POSN                               0x7
#define _RXFBCON3_F7BP_3_POSITION                           0x7
#define _RXFBCON3_F7BP_3_SIZE                               0x1
#define _RXFBCON3_F7BP_3_LENGTH                             0x1
#define _RXFBCON3_F7BP_3_MASK                               0x80
#define _RXFBCON3_F6BP_01_POSN                              0x0
#define _RXFBCON3_F6BP_01_POSITION                          0x0
#define _RXFBCON3_F6BP_01_SIZE                              0x1
#define _RXFBCON3_F6BP_01_LENGTH                            0x1
#define _RXFBCON3_F6BP_01_MASK                              0x1

// Register: RXFBCON4
#define RXFBCON4 RXFBCON4
extern volatile unsigned char           RXFBCON4            __at(0xE75);
#ifndef _LIB_BUILD
asm("RXFBCON4 equ 0E75h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned F8BP                   :4;
        unsigned F9BP                   :4;
    };
    struct {
        unsigned F8BP_0                 :1;
        unsigned F8BP_1                 :1;
        unsigned F8BP_2                 :1;
        unsigned F8BP_3                 :1;
        unsigned F9BP_0                 :1;
        unsigned F9BP_1                 :1;
        unsigned F9BP_2                 :1;
        unsigned F9BP_3                 :1;
    };
    struct {
        unsigned F8BP_01                :1;
    };
} RXFBCON4bits_t;
extern volatile RXFBCON4bits_t RXFBCON4bits __at(0xE75);
// bitfield macros
#define _RXFBCON4_F8BP_POSN                                 0x0
#define _RXFBCON4_F8BP_POSITION                             0x0
#define _RXFBCON4_F8BP_SIZE                                 0x4
#define _RXFBCON4_F8BP_LENGTH                               0x4
#define _RXFBCON4_F8BP_MASK                                 0xF
#define _RXFBCON4_F9BP_POSN                                 0x4
#define _RXFBCON4_F9BP_POSITION                             0x4
#define _RXFBCON4_F9BP_SIZE                                 0x4
#define _RXFBCON4_F9BP_LENGTH                               0x4
#define _RXFBCON4_F9BP_MASK                                 0xF0
#define _RXFBCON4_F8BP_0_POSN                               0x0
#define _RXFBCON4_F8BP_0_POSITION                           0x0
#define _RXFBCON4_F8BP_0_SIZE                               0x1
#define _RXFBCON4_F8BP_0_LENGTH                             0x1
#define _RXFBCON4_F8BP_0_MASK                               0x1
#define _RXFBCON4_F8BP_1_POSN                               0x1
#define _RXFBCON4_F8BP_1_POSITION                           0x1
#define _RXFBCON4_F8BP_1_SIZE                               0x1
#define _RXFBCON4_F8BP_1_LENGTH                             0x1
#define _RXFBCON4_F8BP_1_MASK                               0x2
#define _RXFBCON4_F8BP_2_POSN                               0x2
#define _RXFBCON4_F8BP_2_POSITION                           0x2
#define _RXFBCON4_F8BP_2_SIZE                               0x1
#define _RXFBCON4_F8BP_2_LENGTH                             0x1
#define _RXFBCON4_F8BP_2_MASK                               0x4
#define _RXFBCON4_F8BP_3_POSN                               0x3
#define _RXFBCON4_F8BP_3_POSITION                           0x3
#define _RXFBCON4_F8BP_3_SIZE                               0x1
#define _RXFBCON4_F8BP_3_LENGTH                             0x1
#define _RXFBCON4_F8BP_3_MASK                               0x8
#define _RXFBCON4_F9BP_0_POSN                               0x4
#define _RXFBCON4_F9BP_0_POSITION                           0x4
#define _RXFBCON4_F9BP_0_SIZE                               0x1
#define _RXFBCON4_F9BP_0_LENGTH                             0x1
#define _RXFBCON4_F9BP_0_MASK                               0x10
#define _RXFBCON4_F9BP_1_POSN                               0x5
#define _RXFBCON4_F9BP_1_POSITION                           0x5
#define _RXFBCON4_F9BP_1_SIZE                               0x1
#define _RXFBCON4_F9BP_1_LENGTH                             0x1
#define _RXFBCON4_F9BP_1_MASK                               0x20
#define _RXFBCON4_F9BP_2_POSN                               0x6
#define _RXFBCON4_F9BP_2_POSITION                           0x6
#define _RXFBCON4_F9BP_2_SIZE                               0x1
#define _RXFBCON4_F9BP_2_LENGTH                             0x1
#define _RXFBCON4_F9BP_2_MASK                               0x40
#define _RXFBCON4_F9BP_3_POSN                               0x7
#define _RXFBCON4_F9BP_3_POSITION                           0x7
#define _RXFBCON4_F9BP_3_SIZE                               0x1
#define _RXFBCON4_F9BP_3_LENGTH                             0x1
#define _RXFBCON4_F9BP_3_MASK                               0x80
#define _RXFBCON4_F8BP_01_POSN                              0x0
#define _RXFBCON4_F8BP_01_POSITION                          0x0
#define _RXFBCON4_F8BP_01_SIZE                              0x1
#define _RXFBCON4_F8BP_01_LENGTH                            0x1
#define _RXFBCON4_F8BP_01_MASK                              0x1

// Register: RXFBCON5
#define RXFBCON5 RXFBCON5
extern volatile unsigned char           RXFBCON5            __at(0xE76);
#ifndef _LIB_BUILD
asm("RXFBCON5 equ 0E76h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned F10BP                  :4;
        unsigned F11BP                  :4;
    };
    struct {
        unsigned F10BP_0                :1;
        unsigned F10BP_1                :1;
        unsigned F10BP_2                :1;
        unsigned F10BP_3                :1;
        unsigned F11BP_0                :1;
        unsigned F11BP_1                :1;
        unsigned F11BP_2                :1;
        unsigned F11BP_3                :1;
    };
    struct {
        unsigned F10BP_01               :1;
    };
} RXFBCON5bits_t;
