MikroElektronika/core_packages/PIC/XC8/def/PIC18LF45K80/mcu.h
extern volatile RXFBCON5bits_t RXFBCON5bits __at(0xE76);
// bitfield macros
#define _RXFBCON5_F10BP_POSN                                0x0
#define _RXFBCON5_F10BP_POSITION                            0x0
#define _RXFBCON5_F10BP_SIZE                                0x4
#define _RXFBCON5_F10BP_LENGTH                              0x4
#define _RXFBCON5_F10BP_MASK                                0xF
#define _RXFBCON5_F11BP_POSN                                0x4
#define _RXFBCON5_F11BP_POSITION                            0x4
#define _RXFBCON5_F11BP_SIZE                                0x4
#define _RXFBCON5_F11BP_LENGTH                              0x4
#define _RXFBCON5_F11BP_MASK                                0xF0
#define _RXFBCON5_F10BP_0_POSN                              0x0
#define _RXFBCON5_F10BP_0_POSITION                          0x0
#define _RXFBCON5_F10BP_0_SIZE                              0x1
#define _RXFBCON5_F10BP_0_LENGTH                            0x1
#define _RXFBCON5_F10BP_0_MASK                              0x1
#define _RXFBCON5_F10BP_1_POSN                              0x1
#define _RXFBCON5_F10BP_1_POSITION                          0x1
#define _RXFBCON5_F10BP_1_SIZE                              0x1
#define _RXFBCON5_F10BP_1_LENGTH                            0x1
#define _RXFBCON5_F10BP_1_MASK                              0x2
#define _RXFBCON5_F10BP_2_POSN                              0x2
#define _RXFBCON5_F10BP_2_POSITION                          0x2
#define _RXFBCON5_F10BP_2_SIZE                              0x1
#define _RXFBCON5_F10BP_2_LENGTH                            0x1
#define _RXFBCON5_F10BP_2_MASK                              0x4
#define _RXFBCON5_F10BP_3_POSN                              0x3
#define _RXFBCON5_F10BP_3_POSITION                          0x3
#define _RXFBCON5_F10BP_3_SIZE                              0x1
#define _RXFBCON5_F10BP_3_LENGTH                            0x1
#define _RXFBCON5_F10BP_3_MASK                              0x8
#define _RXFBCON5_F11BP_0_POSN                              0x4
#define _RXFBCON5_F11BP_0_POSITION                          0x4
#define _RXFBCON5_F11BP_0_SIZE                              0x1
#define _RXFBCON5_F11BP_0_LENGTH                            0x1
#define _RXFBCON5_F11BP_0_MASK                              0x10
#define _RXFBCON5_F11BP_1_POSN                              0x5
#define _RXFBCON5_F11BP_1_POSITION                          0x5
#define _RXFBCON5_F11BP_1_SIZE                              0x1
#define _RXFBCON5_F11BP_1_LENGTH                            0x1
#define _RXFBCON5_F11BP_1_MASK                              0x20
#define _RXFBCON5_F11BP_2_POSN                              0x6
#define _RXFBCON5_F11BP_2_POSITION                          0x6
#define _RXFBCON5_F11BP_2_SIZE                              0x1
#define _RXFBCON5_F11BP_2_LENGTH                            0x1
#define _RXFBCON5_F11BP_2_MASK                              0x40
#define _RXFBCON5_F11BP_3_POSN                              0x7
#define _RXFBCON5_F11BP_3_POSITION                          0x7
#define _RXFBCON5_F11BP_3_SIZE                              0x1
#define _RXFBCON5_F11BP_3_LENGTH                            0x1
#define _RXFBCON5_F11BP_3_MASK                              0x80
#define _RXFBCON5_F10BP_01_POSN                             0x0
#define _RXFBCON5_F10BP_01_POSITION                         0x0
#define _RXFBCON5_F10BP_01_SIZE                             0x1
#define _RXFBCON5_F10BP_01_LENGTH                           0x1
#define _RXFBCON5_F10BP_01_MASK                             0x1

// Register: RXFBCON6
#define RXFBCON6 RXFBCON6
extern volatile unsigned char           RXFBCON6            __at(0xE77);
#ifndef _LIB_BUILD
asm("RXFBCON6 equ 0E77h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned F12BP                  :4;
        unsigned F13BP                  :4;
    };
    struct {
        unsigned F12BP_0                :1;
        unsigned F12BP_1                :1;
        unsigned F12BP_2                :1;
        unsigned F12BP_3                :1;
        unsigned F13BP_0                :1;
        unsigned F13BP_1                :1;
        unsigned F13BP_2                :1;
        unsigned F13BP_3                :1;
    };
    struct {
        unsigned F12BP_01               :1;
    };
} RXFBCON6bits_t;
extern volatile RXFBCON6bits_t RXFBCON6bits __at(0xE77);
// bitfield macros
#define _RXFBCON6_F12BP_POSN                                0x0
#define _RXFBCON6_F12BP_POSITION                            0x0
#define _RXFBCON6_F12BP_SIZE                                0x4
#define _RXFBCON6_F12BP_LENGTH                              0x4
#define _RXFBCON6_F12BP_MASK                                0xF
#define _RXFBCON6_F13BP_POSN                                0x4
#define _RXFBCON6_F13BP_POSITION                            0x4
#define _RXFBCON6_F13BP_SIZE                                0x4
#define _RXFBCON6_F13BP_LENGTH                              0x4
#define _RXFBCON6_F13BP_MASK                                0xF0
#define _RXFBCON6_F12BP_0_POSN                              0x0
#define _RXFBCON6_F12BP_0_POSITION                          0x0
#define _RXFBCON6_F12BP_0_SIZE                              0x1
#define _RXFBCON6_F12BP_0_LENGTH                            0x1
#define _RXFBCON6_F12BP_0_MASK                              0x1
#define _RXFBCON6_F12BP_1_POSN                              0x1
#define _RXFBCON6_F12BP_1_POSITION                          0x1
#define _RXFBCON6_F12BP_1_SIZE                              0x1
#define _RXFBCON6_F12BP_1_LENGTH                            0x1
#define _RXFBCON6_F12BP_1_MASK                              0x2
#define _RXFBCON6_F12BP_2_POSN                              0x2
#define _RXFBCON6_F12BP_2_POSITION                          0x2
#define _RXFBCON6_F12BP_2_SIZE                              0x1
#define _RXFBCON6_F12BP_2_LENGTH                            0x1
#define _RXFBCON6_F12BP_2_MASK                              0x4
#define _RXFBCON6_F12BP_3_POSN                              0x3
#define _RXFBCON6_F12BP_3_POSITION                          0x3
#define _RXFBCON6_F12BP_3_SIZE                              0x1
#define _RXFBCON6_F12BP_3_LENGTH                            0x1
#define _RXFBCON6_F12BP_3_MASK                              0x8
#define _RXFBCON6_F13BP_0_POSN                              0x4
#define _RXFBCON6_F13BP_0_POSITION                          0x4
#define _RXFBCON6_F13BP_0_SIZE                              0x1
#define _RXFBCON6_F13BP_0_LENGTH                            0x1
#define _RXFBCON6_F13BP_0_MASK                              0x10
#define _RXFBCON6_F13BP_1_POSN                              0x5
#define _RXFBCON6_F13BP_1_POSITION                          0x5
#define _RXFBCON6_F13BP_1_SIZE                              0x1
#define _RXFBCON6_F13BP_1_LENGTH                            0x1
#define _RXFBCON6_F13BP_1_MASK                              0x20
#define _RXFBCON6_F13BP_2_POSN                              0x6
#define _RXFBCON6_F13BP_2_POSITION                          0x6
#define _RXFBCON6_F13BP_2_SIZE                              0x1
#define _RXFBCON6_F13BP_2_LENGTH                            0x1
#define _RXFBCON6_F13BP_2_MASK                              0x40
#define _RXFBCON6_F13BP_3_POSN                              0x7
#define _RXFBCON6_F13BP_3_POSITION                          0x7
#define _RXFBCON6_F13BP_3_SIZE                              0x1
#define _RXFBCON6_F13BP_3_LENGTH                            0x1
#define _RXFBCON6_F13BP_3_MASK                              0x80
#define _RXFBCON6_F12BP_01_POSN                             0x0
#define _RXFBCON6_F12BP_01_POSITION                         0x0
#define _RXFBCON6_F12BP_01_SIZE                             0x1
#define _RXFBCON6_F12BP_01_LENGTH                           0x1
#define _RXFBCON6_F12BP_01_MASK                             0x1

// Register: RXFBCON7
#define RXFBCON7 RXFBCON7
extern volatile unsigned char           RXFBCON7            __at(0xE78);
#ifndef _LIB_BUILD
asm("RXFBCON7 equ 0E78h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned F14BP                  :4;
        unsigned F15BP                  :4;
    };
    struct {
        unsigned F14BP_0                :1;
        unsigned F14BP_1                :1;
        unsigned F14BP_2                :1;
        unsigned F14BP_3                :1;
        unsigned F15BP_0                :1;
        unsigned F15BP_1                :1;
        unsigned F15BP_2                :1;
        unsigned F15BP_3                :1;
    };
    struct {
        unsigned F14BP_01               :1;
    };
} RXFBCON7bits_t;
extern volatile RXFBCON7bits_t RXFBCON7bits __at(0xE78);
// bitfield macros
#define _RXFBCON7_F14BP_POSN                                0x0
#define _RXFBCON7_F14BP_POSITION                            0x0
#define _RXFBCON7_F14BP_SIZE                                0x4
#define _RXFBCON7_F14BP_LENGTH                              0x4
#define _RXFBCON7_F14BP_MASK                                0xF
#define _RXFBCON7_F15BP_POSN                                0x4
#define _RXFBCON7_F15BP_POSITION                            0x4
#define _RXFBCON7_F15BP_SIZE                                0x4
#define _RXFBCON7_F15BP_LENGTH                              0x4
#define _RXFBCON7_F15BP_MASK                                0xF0
#define _RXFBCON7_F14BP_0_POSN                              0x0
#define _RXFBCON7_F14BP_0_POSITION                          0x0
#define _RXFBCON7_F14BP_0_SIZE                              0x1
#define _RXFBCON7_F14BP_0_LENGTH                            0x1
#define _RXFBCON7_F14BP_0_MASK                              0x1
#define _RXFBCON7_F14BP_1_POSN                              0x1
#define _RXFBCON7_F14BP_1_POSITION                          0x1
#define _RXFBCON7_F14BP_1_SIZE                              0x1
#define _RXFBCON7_F14BP_1_LENGTH                            0x1
#define _RXFBCON7_F14BP_1_MASK                              0x2
#define _RXFBCON7_F14BP_2_POSN                              0x2
#define _RXFBCON7_F14BP_2_POSITION                          0x2
#define _RXFBCON7_F14BP_2_SIZE                              0x1
#define _RXFBCON7_F14BP_2_LENGTH                            0x1
#define _RXFBCON7_F14BP_2_MASK                              0x4
#define _RXFBCON7_F14BP_3_POSN                              0x3
#define _RXFBCON7_F14BP_3_POSITION                          0x3
#define _RXFBCON7_F14BP_3_SIZE                              0x1
#define _RXFBCON7_F14BP_3_LENGTH                            0x1
#define _RXFBCON7_F14BP_3_MASK                              0x8
#define _RXFBCON7_F15BP_0_POSN                              0x4
#define _RXFBCON7_F15BP_0_POSITION                          0x4
#define _RXFBCON7_F15BP_0_SIZE                              0x1
#define _RXFBCON7_F15BP_0_LENGTH                            0x1
#define _RXFBCON7_F15BP_0_MASK                              0x10
#define _RXFBCON7_F15BP_1_POSN                              0x5
#define _RXFBCON7_F15BP_1_POSITION                          0x5
#define _RXFBCON7_F15BP_1_SIZE                              0x1
#define _RXFBCON7_F15BP_1_LENGTH                            0x1
#define _RXFBCON7_F15BP_1_MASK                              0x20
#define _RXFBCON7_F15BP_2_POSN                              0x6
#define _RXFBCON7_F15BP_2_POSITION                          0x6
#define _RXFBCON7_F15BP_2_SIZE                              0x1
#define _RXFBCON7_F15BP_2_LENGTH                            0x1
#define _RXFBCON7_F15BP_2_MASK                              0x40
#define _RXFBCON7_F15BP_3_POSN                              0x7
#define _RXFBCON7_F15BP_3_POSITION                          0x7
#define _RXFBCON7_F15BP_3_SIZE                              0x1
#define _RXFBCON7_F15BP_3_LENGTH                            0x1
#define _RXFBCON7_F15BP_3_MASK                              0x80
#define _RXFBCON7_F14BP_01_POSN                             0x0
#define _RXFBCON7_F14BP_01_POSITION                         0x0
#define _RXFBCON7_F14BP_01_SIZE                             0x1
#define _RXFBCON7_F14BP_01_LENGTH                           0x1
#define _RXFBCON7_F14BP_01_MASK                             0x1

// Register: MSEL0
#define MSEL0 MSEL0
extern volatile unsigned char           MSEL0               __at(0xE79);
#ifndef _LIB_BUILD
asm("MSEL0 equ 0E79h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FIL0                   :2;
        unsigned FIL1                   :2;
        unsigned FIL2                   :2;
        unsigned FIL3                   :2;
    };
    struct {
        unsigned FIL0_0                 :1;
        unsigned FIL0_1                 :1;
        unsigned FIL1_0                 :1;
        unsigned FIL1_1                 :1;
        unsigned FIL2_0                 :1;
        unsigned FIL2_1                 :1;
        unsigned FIL3_0                 :1;
        unsigned FIL3_1                 :1;
    };
} MSEL0bits_t;
extern volatile MSEL0bits_t MSEL0bits __at(0xE79);
// bitfield macros
#define _MSEL0_FIL0_POSN                                    0x0
#define _MSEL0_FIL0_POSITION                                0x0
#define _MSEL0_FIL0_SIZE                                    0x2
#define _MSEL0_FIL0_LENGTH                                  0x2
#define _MSEL0_FIL0_MASK                                    0x3
#define _MSEL0_FIL1_POSN                                    0x2
#define _MSEL0_FIL1_POSITION                                0x2
#define _MSEL0_FIL1_SIZE                                    0x2
#define _MSEL0_FIL1_LENGTH                                  0x2
#define _MSEL0_FIL1_MASK                                    0xC
#define _MSEL0_FIL2_POSN                                    0x4
#define _MSEL0_FIL2_POSITION                                0x4
#define _MSEL0_FIL2_SIZE                                    0x2
#define _MSEL0_FIL2_LENGTH                                  0x2
#define _MSEL0_FIL2_MASK                                    0x30
#define _MSEL0_FIL3_POSN                                    0x6
#define _MSEL0_FIL3_POSITION                                0x6
#define _MSEL0_FIL3_SIZE                                    0x2
#define _MSEL0_FIL3_LENGTH                                  0x2
#define _MSEL0_FIL3_MASK                                    0xC0
#define _MSEL0_FIL0_0_POSN                                  0x0
#define _MSEL0_FIL0_0_POSITION                              0x0
#define _MSEL0_FIL0_0_SIZE                                  0x1
#define _MSEL0_FIL0_0_LENGTH                                0x1
#define _MSEL0_FIL0_0_MASK                                  0x1
#define _MSEL0_FIL0_1_POSN                                  0x1
#define _MSEL0_FIL0_1_POSITION                              0x1
#define _MSEL0_FIL0_1_SIZE                                  0x1
#define _MSEL0_FIL0_1_LENGTH                                0x1
#define _MSEL0_FIL0_1_MASK                                  0x2
#define _MSEL0_FIL1_0_POSN                                  0x2
#define _MSEL0_FIL1_0_POSITION                              0x2
#define _MSEL0_FIL1_0_SIZE                                  0x1
#define _MSEL0_FIL1_0_LENGTH                                0x1
#define _MSEL0_FIL1_0_MASK                                  0x4
#define _MSEL0_FIL1_1_POSN                                  0x3
#define _MSEL0_FIL1_1_POSITION                              0x3
#define _MSEL0_FIL1_1_SIZE                                  0x1
#define _MSEL0_FIL1_1_LENGTH                                0x1
#define _MSEL0_FIL1_1_MASK                                  0x8
#define _MSEL0_FIL2_0_POSN                                  0x4
#define _MSEL0_FIL2_0_POSITION                              0x4
#define _MSEL0_FIL2_0_SIZE                                  0x1
#define _MSEL0_FIL2_0_LENGTH                                0x1
#define _MSEL0_FIL2_0_MASK                                  0x10
#define _MSEL0_FIL2_1_POSN                                  0x5
#define _MSEL0_FIL2_1_POSITION                              0x5
#define _MSEL0_FIL2_1_SIZE                                  0x1
#define _MSEL0_FIL2_1_LENGTH                                0x1
#define _MSEL0_FIL2_1_MASK                                  0x20
#define _MSEL0_FIL3_0_POSN                                  0x6
#define _MSEL0_FIL3_0_POSITION                              0x6
#define _MSEL0_FIL3_0_SIZE                                  0x1
#define _MSEL0_FIL3_0_LENGTH                                0x1
#define _MSEL0_FIL3_0_MASK                                  0x40
#define _MSEL0_FIL3_1_POSN                                  0x7
#define _MSEL0_FIL3_1_POSITION                              0x7
#define _MSEL0_FIL3_1_SIZE                                  0x1
#define _MSEL0_FIL3_1_LENGTH                                0x1
#define _MSEL0_FIL3_1_MASK                                  0x80

// Register: MSEL1
#define MSEL1 MSEL1
extern volatile unsigned char           MSEL1               __at(0xE7A);
#ifndef _LIB_BUILD
asm("MSEL1 equ 0E7Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FIL4                   :2;
        unsigned FIL5                   :2;
        unsigned FIL6                   :2;
        unsigned FIL7                   :2;
    };
    struct {
        unsigned FIL4_0                 :1;
        unsigned FIL4_1                 :1;
        unsigned FIL5_0                 :1;
        unsigned FIL5_1                 :1;
        unsigned FIL6_0                 :1;
        unsigned FIL6_1                 :1;
        unsigned FIL7_0                 :1;
        unsigned FIL7_1                 :1;
    };
} MSEL1bits_t;
extern volatile MSEL1bits_t MSEL1bits __at(0xE7A);
// bitfield macros
#define _MSEL1_FIL4_POSN                                    0x0
#define _MSEL1_FIL4_POSITION                                0x0
#define _MSEL1_FIL4_SIZE                                    0x2
#define _MSEL1_FIL4_LENGTH                                  0x2
#define _MSEL1_FIL4_MASK                                    0x3
#define _MSEL1_FIL5_POSN                                    0x2
#define _MSEL1_FIL5_POSITION                                0x2
#define _MSEL1_FIL5_SIZE                                    0x2
#define _MSEL1_FIL5_LENGTH                                  0x2
#define _MSEL1_FIL5_MASK                                    0xC
#define _MSEL1_FIL6_POSN                                    0x4
#define _MSEL1_FIL6_POSITION                                0x4
#define _MSEL1_FIL6_SIZE                                    0x2
#define _MSEL1_FIL6_LENGTH                                  0x2
#define _MSEL1_FIL6_MASK                                    0x30
#define _MSEL1_FIL7_POSN                                    0x6
#define _MSEL1_FIL7_POSITION                                0x6
#define _MSEL1_FIL7_SIZE                                    0x2
#define _MSEL1_FIL7_LENGTH                                  0x2
#define _MSEL1_FIL7_MASK                                    0xC0
#define _MSEL1_FIL4_0_POSN                                  0x0
#define _MSEL1_FIL4_0_POSITION                              0x0
#define _MSEL1_FIL4_0_SIZE                                  0x1
#define _MSEL1_FIL4_0_LENGTH                                0x1
#define _MSEL1_FIL4_0_MASK                                  0x1
#define _MSEL1_FIL4_1_POSN                                  0x1
#define _MSEL1_FIL4_1_POSITION                              0x1
#define _MSEL1_FIL4_1_SIZE                                  0x1
#define _MSEL1_FIL4_1_LENGTH                                0x1
#define _MSEL1_FIL4_1_MASK                                  0x2
#define _MSEL1_FIL5_0_POSN                                  0x2
#define _MSEL1_FIL5_0_POSITION                              0x2
#define _MSEL1_FIL5_0_SIZE                                  0x1
#define _MSEL1_FIL5_0_LENGTH                                0x1
#define _MSEL1_FIL5_0_MASK                                  0x4
#define _MSEL1_FIL5_1_POSN                                  0x3
#define _MSEL1_FIL5_1_POSITION                              0x3
#define _MSEL1_FIL5_1_SIZE                                  0x1
#define _MSEL1_FIL5_1_LENGTH                                0x1
#define _MSEL1_FIL5_1_MASK                                  0x8
#define _MSEL1_FIL6_0_POSN                                  0x4
#define _MSEL1_FIL6_0_POSITION                              0x4
#define _MSEL1_FIL6_0_SIZE                                  0x1
#define _MSEL1_FIL6_0_LENGTH                                0x1
#define _MSEL1_FIL6_0_MASK                                  0x10
#define _MSEL1_FIL6_1_POSN                                  0x5
#define _MSEL1_FIL6_1_POSITION                              0x5
#define _MSEL1_FIL6_1_SIZE                                  0x1
#define _MSEL1_FIL6_1_LENGTH                                0x1
#define _MSEL1_FIL6_1_MASK                                  0x20
#define _MSEL1_FIL7_0_POSN                                  0x6
#define _MSEL1_FIL7_0_POSITION                              0x6
#define _MSEL1_FIL7_0_SIZE                                  0x1
#define _MSEL1_FIL7_0_LENGTH                                0x1
#define _MSEL1_FIL7_0_MASK                                  0x40
#define _MSEL1_FIL7_1_POSN                                  0x7
#define _MSEL1_FIL7_1_POSITION                              0x7
#define _MSEL1_FIL7_1_SIZE                                  0x1
#define _MSEL1_FIL7_1_LENGTH                                0x1
#define _MSEL1_FIL7_1_MASK                                  0x80

// Register: MSEL2
#define MSEL2 MSEL2
extern volatile unsigned char           MSEL2               __at(0xE7B);
#ifndef _LIB_BUILD
asm("MSEL2 equ 0E7Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FIL8                   :2;
        unsigned FIL9                   :2;
        unsigned FIL10                  :2;
        unsigned FIL11                  :2;
    };
    struct {
        unsigned FIL8_0                 :1;
        unsigned FIL8_1                 :1;
        unsigned FIL9_0                 :1;
        unsigned FIL9_1                 :1;
        unsigned FIL10_0                :1;
        unsigned FIL10_1                :1;
        unsigned FIL11_0                :1;
        unsigned FIL11_1                :1;
    };
} MSEL2bits_t;
