MikroElektronika/core_packages/PIC/XC8/def/PIC18LF45K80/mcu.h
extern volatile B3D0bits_t B3D0bits __at(0xEB6);
// bitfield macros
#define _B3D0_B3D0_POSN                                     0x0
#define _B3D0_B3D0_POSITION                                 0x0
#define _B3D0_B3D0_SIZE                                     0x8
#define _B3D0_B3D0_LENGTH                                   0x8
#define _B3D0_B3D0_MASK                                     0xFF
#define _B3D0_B3D00_POSN                                    0x0
#define _B3D0_B3D00_POSITION                                0x0
#define _B3D0_B3D00_SIZE                                    0x1
#define _B3D0_B3D00_LENGTH                                  0x1
#define _B3D0_B3D00_MASK                                    0x1
#define _B3D0_B3D01_POSN                                    0x1
#define _B3D0_B3D01_POSITION                                0x1
#define _B3D0_B3D01_SIZE                                    0x1
#define _B3D0_B3D01_LENGTH                                  0x1
#define _B3D0_B3D01_MASK                                    0x2
#define _B3D0_B3D02_POSN                                    0x2
#define _B3D0_B3D02_POSITION                                0x2
#define _B3D0_B3D02_SIZE                                    0x1
#define _B3D0_B3D02_LENGTH                                  0x1
#define _B3D0_B3D02_MASK                                    0x4
#define _B3D0_B3D03_POSN                                    0x3
#define _B3D0_B3D03_POSITION                                0x3
#define _B3D0_B3D03_SIZE                                    0x1
#define _B3D0_B3D03_LENGTH                                  0x1
#define _B3D0_B3D03_MASK                                    0x8
#define _B3D0_B3D04_POSN                                    0x4
#define _B3D0_B3D04_POSITION                                0x4
#define _B3D0_B3D04_SIZE                                    0x1
#define _B3D0_B3D04_LENGTH                                  0x1
#define _B3D0_B3D04_MASK                                    0x10
#define _B3D0_B3D05_POSN                                    0x5
#define _B3D0_B3D05_POSITION                                0x5
#define _B3D0_B3D05_SIZE                                    0x1
#define _B3D0_B3D05_LENGTH                                  0x1
#define _B3D0_B3D05_MASK                                    0x20
#define _B3D0_B3D06_POSN                                    0x6
#define _B3D0_B3D06_POSITION                                0x6
#define _B3D0_B3D06_SIZE                                    0x1
#define _B3D0_B3D06_LENGTH                                  0x1
#define _B3D0_B3D06_MASK                                    0x40
#define _B3D0_B3D07_POSN                                    0x7
#define _B3D0_B3D07_POSITION                                0x7
#define _B3D0_B3D07_SIZE                                    0x1
#define _B3D0_B3D07_LENGTH                                  0x1
#define _B3D0_B3D07_MASK                                    0x80

// Register: B3D1
#define B3D1 B3D1
extern volatile unsigned char           B3D1                __at(0xEB7);
#ifndef _LIB_BUILD
asm("B3D1 equ 0EB7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B3D1                   :8;
    };
    struct {
        unsigned B3D10                  :1;
        unsigned B3D11                  :1;
        unsigned B3D12                  :1;
        unsigned B3D13                  :1;
        unsigned B3D14                  :1;
        unsigned B3D15                  :1;
        unsigned B3D16                  :1;
        unsigned B3D17                  :1;
    };
} B3D1bits_t;
extern volatile B3D1bits_t B3D1bits __at(0xEB7);
// bitfield macros
#define _B3D1_B3D1_POSN                                     0x0
#define _B3D1_B3D1_POSITION                                 0x0
#define _B3D1_B3D1_SIZE                                     0x8
#define _B3D1_B3D1_LENGTH                                   0x8
#define _B3D1_B3D1_MASK                                     0xFF
#define _B3D1_B3D10_POSN                                    0x0
#define _B3D1_B3D10_POSITION                                0x0
#define _B3D1_B3D10_SIZE                                    0x1
#define _B3D1_B3D10_LENGTH                                  0x1
#define _B3D1_B3D10_MASK                                    0x1
#define _B3D1_B3D11_POSN                                    0x1
#define _B3D1_B3D11_POSITION                                0x1
#define _B3D1_B3D11_SIZE                                    0x1
#define _B3D1_B3D11_LENGTH                                  0x1
#define _B3D1_B3D11_MASK                                    0x2
#define _B3D1_B3D12_POSN                                    0x2
#define _B3D1_B3D12_POSITION                                0x2
#define _B3D1_B3D12_SIZE                                    0x1
#define _B3D1_B3D12_LENGTH                                  0x1
#define _B3D1_B3D12_MASK                                    0x4
#define _B3D1_B3D13_POSN                                    0x3
#define _B3D1_B3D13_POSITION                                0x3
#define _B3D1_B3D13_SIZE                                    0x1
#define _B3D1_B3D13_LENGTH                                  0x1
#define _B3D1_B3D13_MASK                                    0x8
#define _B3D1_B3D14_POSN                                    0x4
#define _B3D1_B3D14_POSITION                                0x4
#define _B3D1_B3D14_SIZE                                    0x1
#define _B3D1_B3D14_LENGTH                                  0x1
#define _B3D1_B3D14_MASK                                    0x10
#define _B3D1_B3D15_POSN                                    0x5
#define _B3D1_B3D15_POSITION                                0x5
#define _B3D1_B3D15_SIZE                                    0x1
#define _B3D1_B3D15_LENGTH                                  0x1
#define _B3D1_B3D15_MASK                                    0x20
#define _B3D1_B3D16_POSN                                    0x6
#define _B3D1_B3D16_POSITION                                0x6
#define _B3D1_B3D16_SIZE                                    0x1
#define _B3D1_B3D16_LENGTH                                  0x1
#define _B3D1_B3D16_MASK                                    0x40
#define _B3D1_B3D17_POSN                                    0x7
#define _B3D1_B3D17_POSITION                                0x7
#define _B3D1_B3D17_SIZE                                    0x1
#define _B3D1_B3D17_LENGTH                                  0x1
#define _B3D1_B3D17_MASK                                    0x80

// Register: B3D2
#define B3D2 B3D2
extern volatile unsigned char           B3D2                __at(0xEB8);
#ifndef _LIB_BUILD
asm("B3D2 equ 0EB8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B3D2                   :8;
    };
    struct {
        unsigned B3D20                  :1;
        unsigned B3D21                  :1;
        unsigned B3D22                  :1;
        unsigned B3D23                  :1;
        unsigned B3D24                  :1;
        unsigned B3D25                  :1;
        unsigned B3D26                  :1;
        unsigned B3D27                  :1;
    };
} B3D2bits_t;
extern volatile B3D2bits_t B3D2bits __at(0xEB8);
// bitfield macros
#define _B3D2_B3D2_POSN                                     0x0
#define _B3D2_B3D2_POSITION                                 0x0
#define _B3D2_B3D2_SIZE                                     0x8
#define _B3D2_B3D2_LENGTH                                   0x8
#define _B3D2_B3D2_MASK                                     0xFF
#define _B3D2_B3D20_POSN                                    0x0
#define _B3D2_B3D20_POSITION                                0x0
#define _B3D2_B3D20_SIZE                                    0x1
#define _B3D2_B3D20_LENGTH                                  0x1
#define _B3D2_B3D20_MASK                                    0x1
#define _B3D2_B3D21_POSN                                    0x1
#define _B3D2_B3D21_POSITION                                0x1
#define _B3D2_B3D21_SIZE                                    0x1
#define _B3D2_B3D21_LENGTH                                  0x1
#define _B3D2_B3D21_MASK                                    0x2
#define _B3D2_B3D22_POSN                                    0x2
#define _B3D2_B3D22_POSITION                                0x2
#define _B3D2_B3D22_SIZE                                    0x1
#define _B3D2_B3D22_LENGTH                                  0x1
#define _B3D2_B3D22_MASK                                    0x4
#define _B3D2_B3D23_POSN                                    0x3
#define _B3D2_B3D23_POSITION                                0x3
#define _B3D2_B3D23_SIZE                                    0x1
#define _B3D2_B3D23_LENGTH                                  0x1
#define _B3D2_B3D23_MASK                                    0x8
#define _B3D2_B3D24_POSN                                    0x4
#define _B3D2_B3D24_POSITION                                0x4
#define _B3D2_B3D24_SIZE                                    0x1
#define _B3D2_B3D24_LENGTH                                  0x1
#define _B3D2_B3D24_MASK                                    0x10
#define _B3D2_B3D25_POSN                                    0x5
#define _B3D2_B3D25_POSITION                                0x5
#define _B3D2_B3D25_SIZE                                    0x1
#define _B3D2_B3D25_LENGTH                                  0x1
#define _B3D2_B3D25_MASK                                    0x20
#define _B3D2_B3D26_POSN                                    0x6
#define _B3D2_B3D26_POSITION                                0x6
#define _B3D2_B3D26_SIZE                                    0x1
#define _B3D2_B3D26_LENGTH                                  0x1
#define _B3D2_B3D26_MASK                                    0x40
#define _B3D2_B3D27_POSN                                    0x7
#define _B3D2_B3D27_POSITION                                0x7
#define _B3D2_B3D27_SIZE                                    0x1
#define _B3D2_B3D27_LENGTH                                  0x1
#define _B3D2_B3D27_MASK                                    0x80

