MikroElektronika/core_packages/PIC/XC8/def/PIC18LF45K80/mcu.h
// Register: CANCON_RO6
#define CANCON_RO6 CANCON_RO6
extern volatile unsigned char           CANCON_RO6          __at(0xEBF);
#ifndef _LIB_BUILD
asm("CANCON_RO6 equ 0EBFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FP0                    :1;
        unsigned WIN0_FP1               :1;
        unsigned WIN1_FP2               :1;
        unsigned WIN2_FP3               :1;
        unsigned ABAT                   :1;
        unsigned REQOP                  :3;
    };
    struct {
        unsigned                        :1;
        unsigned WIN0                   :1;
        unsigned WIN1                   :1;
        unsigned WIN2                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned FP1                    :1;
        unsigned FP2                    :1;
        unsigned FP3                    :1;
    };
} CANCON_RO6bits_t;
extern volatile CANCON_RO6bits_t CANCON_RO6bits __at(0xEBF);
// bitfield macros
#define _CANCON_RO6_FP0_POSN                                0x0
#define _CANCON_RO6_FP0_POSITION                            0x0
#define _CANCON_RO6_FP0_SIZE                                0x1
#define _CANCON_RO6_FP0_LENGTH                              0x1
#define _CANCON_RO6_FP0_MASK                                0x1
#define _CANCON_RO6_WIN0_FP1_POSN                           0x1
#define _CANCON_RO6_WIN0_FP1_POSITION                       0x1
#define _CANCON_RO6_WIN0_FP1_SIZE                           0x1
#define _CANCON_RO6_WIN0_FP1_LENGTH                         0x1
#define _CANCON_RO6_WIN0_FP1_MASK                           0x2
#define _CANCON_RO6_WIN1_FP2_POSN                           0x2
#define _CANCON_RO6_WIN1_FP2_POSITION                       0x2
#define _CANCON_RO6_WIN1_FP2_SIZE                           0x1
#define _CANCON_RO6_WIN1_FP2_LENGTH                         0x1
#define _CANCON_RO6_WIN1_FP2_MASK                           0x4
#define _CANCON_RO6_WIN2_FP3_POSN                           0x3
#define _CANCON_RO6_WIN2_FP3_POSITION                       0x3
#define _CANCON_RO6_WIN2_FP3_SIZE                           0x1
#define _CANCON_RO6_WIN2_FP3_LENGTH                         0x1
#define _CANCON_RO6_WIN2_FP3_MASK                           0x8
#define _CANCON_RO6_ABAT_POSN                               0x4
#define _CANCON_RO6_ABAT_POSITION                           0x4
#define _CANCON_RO6_ABAT_SIZE                               0x1
#define _CANCON_RO6_ABAT_LENGTH                             0x1
#define _CANCON_RO6_ABAT_MASK                               0x10
#define _CANCON_RO6_REQOP_POSN                              0x5
#define _CANCON_RO6_REQOP_POSITION                          0x5
#define _CANCON_RO6_REQOP_SIZE                              0x3
#define _CANCON_RO6_REQOP_LENGTH                            0x3
#define _CANCON_RO6_REQOP_MASK                              0xE0
#define _CANCON_RO6_WIN0_POSN                               0x1
#define _CANCON_RO6_WIN0_POSITION                           0x1
#define _CANCON_RO6_WIN0_SIZE                               0x1
#define _CANCON_RO6_WIN0_LENGTH                             0x1
#define _CANCON_RO6_WIN0_MASK                               0x2
#define _CANCON_RO6_WIN1_POSN                               0x2
#define _CANCON_RO6_WIN1_POSITION                           0x2
#define _CANCON_RO6_WIN1_SIZE                               0x1
#define _CANCON_RO6_WIN1_LENGTH                             0x1
#define _CANCON_RO6_WIN1_MASK                               0x4
#define _CANCON_RO6_WIN2_POSN                               0x3
#define _CANCON_RO6_WIN2_POSITION                           0x3
#define _CANCON_RO6_WIN2_SIZE                               0x1
#define _CANCON_RO6_WIN2_LENGTH                             0x1
#define _CANCON_RO6_WIN2_MASK                               0x8
#define _CANCON_RO6_FP1_POSN                                0x1
#define _CANCON_RO6_FP1_POSITION                            0x1
#define _CANCON_RO6_FP1_SIZE                                0x1
#define _CANCON_RO6_FP1_LENGTH                              0x1
#define _CANCON_RO6_FP1_MASK                                0x2
#define _CANCON_RO6_FP2_POSN                                0x2
#define _CANCON_RO6_FP2_POSITION                            0x2
#define _CANCON_RO6_FP2_SIZE                                0x1
#define _CANCON_RO6_FP2_LENGTH                              0x1
#define _CANCON_RO6_FP2_MASK                                0x4
#define _CANCON_RO6_FP3_POSN                                0x3
#define _CANCON_RO6_FP3_POSITION                            0x3
#define _CANCON_RO6_FP3_SIZE                                0x1
#define _CANCON_RO6_FP3_LENGTH                              0x1
#define _CANCON_RO6_FP3_MASK                                0x8

// Register: B4CON
#define B4CON B4CON
extern volatile unsigned char           B4CON               __at(0xEC0);
#ifndef _LIB_BUILD
asm("B4CON equ 0EC0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FILHIT0_TXPRI0         :1;
        unsigned FILHIT1_TXPRI1         :1;
        unsigned FILHIT2_RTREN          :1;
        unsigned FILHIT3_TXREQ          :1;
        unsigned FILHIT4_TXERR          :1;
        unsigned RXRTRRO_TXLARB         :1;
        unsigned RXM1_TXABT             :1;
        unsigned RXFUL_TXBIF            :1;
    };
    struct {
        unsigned FILHIT0                :1;
        unsigned FILHIT1                :1;
        unsigned FILHIT2                :1;
        unsigned FILHIT3                :1;
        unsigned FILHIT4                :1;
        unsigned RXRTRRO                :1;
        unsigned RXM1                   :1;
        unsigned RXFUL                  :1;
    };
    struct {
        unsigned TXPRI0                 :1;
        unsigned TXPRI1                 :1;
        unsigned RTREN                  :1;
        unsigned TXREQ                  :1;
        unsigned TXERR                  :1;
        unsigned TXLARB                 :1;
        unsigned TXABT                  :1;
        unsigned TXBIF                  :1;
    };
    struct {
        unsigned B4FILHIT0              :1;
        unsigned B4FILHIT1              :1;
        unsigned B4FILHIT2              :1;
        unsigned B4FILHIT3              :1;
        unsigned B4FILHIT4              :1;
        unsigned B4RTRRO                :1;
        unsigned B4RXM1                 :1;
        unsigned B4RXFUL                :1;
    };
    struct {
        unsigned B4TXPRI0               :1;
        unsigned B4TXPRI1               :1;
        unsigned B4RTREN                :1;
        unsigned B4TXREQ                :1;
        unsigned B4TXERR                :1;
        unsigned B4TXLARB               :1;
        unsigned B4TXABT                :1;
        unsigned B4TXB3IF               :1;
    };
} B4CONbits_t;
