MikroElektronika/core_packages/PIC/XC8/def/PIC18LF45K80/mcu.h
// Register: B4D7
#define B4D7 B4D7
extern volatile unsigned char           B4D7                __at(0xECD);
#ifndef _LIB_BUILD
asm("B4D7 equ 0ECDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B4D7                   :8;
    };
    struct {
        unsigned B4D70                  :1;
        unsigned B4D71                  :1;
        unsigned B4D72                  :1;
        unsigned B4D73                  :1;
        unsigned B4D74                  :1;
        unsigned B4D75                  :1;
        unsigned B4D76                  :1;
        unsigned B4D77                  :1;
    };
} B4D7bits_t;
extern volatile B4D7bits_t B4D7bits __at(0xECD);
// bitfield macros
#define _B4D7_B4D7_POSN                                     0x0
#define _B4D7_B4D7_POSITION                                 0x0
#define _B4D7_B4D7_SIZE                                     0x8
#define _B4D7_B4D7_LENGTH                                   0x8
#define _B4D7_B4D7_MASK                                     0xFF
#define _B4D7_B4D70_POSN                                    0x0
#define _B4D7_B4D70_POSITION                                0x0
#define _B4D7_B4D70_SIZE                                    0x1
#define _B4D7_B4D70_LENGTH                                  0x1
#define _B4D7_B4D70_MASK                                    0x1
#define _B4D7_B4D71_POSN                                    0x1
#define _B4D7_B4D71_POSITION                                0x1
#define _B4D7_B4D71_SIZE                                    0x1
#define _B4D7_B4D71_LENGTH                                  0x1
#define _B4D7_B4D71_MASK                                    0x2
#define _B4D7_B4D72_POSN                                    0x2
#define _B4D7_B4D72_POSITION                                0x2
#define _B4D7_B4D72_SIZE                                    0x1
#define _B4D7_B4D72_LENGTH                                  0x1
#define _B4D7_B4D72_MASK                                    0x4
#define _B4D7_B4D73_POSN                                    0x3
#define _B4D7_B4D73_POSITION                                0x3
#define _B4D7_B4D73_SIZE                                    0x1
#define _B4D7_B4D73_LENGTH                                  0x1
#define _B4D7_B4D73_MASK                                    0x8
#define _B4D7_B4D74_POSN                                    0x4
#define _B4D7_B4D74_POSITION                                0x4
#define _B4D7_B4D74_SIZE                                    0x1
#define _B4D7_B4D74_LENGTH                                  0x1
#define _B4D7_B4D74_MASK                                    0x10
#define _B4D7_B4D75_POSN                                    0x5
#define _B4D7_B4D75_POSITION                                0x5
#define _B4D7_B4D75_SIZE                                    0x1
#define _B4D7_B4D75_LENGTH                                  0x1
#define _B4D7_B4D75_MASK                                    0x20
#define _B4D7_B4D76_POSN                                    0x6
#define _B4D7_B4D76_POSITION                                0x6
#define _B4D7_B4D76_SIZE                                    0x1
#define _B4D7_B4D76_LENGTH                                  0x1
#define _B4D7_B4D76_MASK                                    0x40
#define _B4D7_B4D77_POSN                                    0x7
#define _B4D7_B4D77_POSITION                                0x7
#define _B4D7_B4D77_SIZE                                    0x1
#define _B4D7_B4D77_LENGTH                                  0x1
#define _B4D7_B4D77_MASK                                    0x80

// Register: CANSTAT_RO5
#define CANSTAT_RO5 CANSTAT_RO5
extern volatile unsigned char           CANSTAT_RO5         __at(0xECE);
#ifndef _LIB_BUILD
asm("CANSTAT_RO5 equ 0ECEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EICODE0                :1;
        unsigned EICODE1_ICODE0         :1;
        unsigned EICODE2_ICODE1         :1;
        unsigned EICODE3_ICODE2         :1;
        unsigned EICODE4                :1;
        unsigned OPMODE                 :3;
    };
    struct {
        unsigned                        :1;
        unsigned EICODE1                :1;
        unsigned EICODE2                :1;
        unsigned EICODE3                :1;
        unsigned                        :1;
        unsigned OPMODE0                :1;
        unsigned OPMODE1                :1;
        unsigned OPMODE2                :1;
    };
    struct {
        unsigned                        :1;
        unsigned ICODE0                 :1;
        unsigned ICODE1                 :1;
        unsigned ICODE2                 :1;
    };
} CANSTAT_RO5bits_t;
extern volatile CANSTAT_RO5bits_t CANSTAT_RO5bits __at(0xECE);
// bitfield macros
#define _CANSTAT_RO5_EICODE0_POSN                           0x0
#define _CANSTAT_RO5_EICODE0_POSITION                       0x0
#define _CANSTAT_RO5_EICODE0_SIZE                           0x1
#define _CANSTAT_RO5_EICODE0_LENGTH                         0x1
#define _CANSTAT_RO5_EICODE0_MASK                           0x1
#define _CANSTAT_RO5_EICODE1_ICODE0_POSN                    0x1
#define _CANSTAT_RO5_EICODE1_ICODE0_POSITION                0x1
#define _CANSTAT_RO5_EICODE1_ICODE0_SIZE                    0x1
#define _CANSTAT_RO5_EICODE1_ICODE0_LENGTH                  0x1
#define _CANSTAT_RO5_EICODE1_ICODE0_MASK                    0x2
#define _CANSTAT_RO5_EICODE2_ICODE1_POSN                    0x2
#define _CANSTAT_RO5_EICODE2_ICODE1_POSITION                0x2
#define _CANSTAT_RO5_EICODE2_ICODE1_SIZE                    0x1
#define _CANSTAT_RO5_EICODE2_ICODE1_LENGTH                  0x1
#define _CANSTAT_RO5_EICODE2_ICODE1_MASK                    0x4
#define _CANSTAT_RO5_EICODE3_ICODE2_POSN                    0x3
#define _CANSTAT_RO5_EICODE3_ICODE2_POSITION                0x3
#define _CANSTAT_RO5_EICODE3_ICODE2_SIZE                    0x1
#define _CANSTAT_RO5_EICODE3_ICODE2_LENGTH                  0x1
#define _CANSTAT_RO5_EICODE3_ICODE2_MASK                    0x8
#define _CANSTAT_RO5_EICODE4_POSN                           0x4
#define _CANSTAT_RO5_EICODE4_POSITION                       0x4
#define _CANSTAT_RO5_EICODE4_SIZE                           0x1
#define _CANSTAT_RO5_EICODE4_LENGTH                         0x1
#define _CANSTAT_RO5_EICODE4_MASK                           0x10
#define _CANSTAT_RO5_OPMODE_POSN                            0x5
#define _CANSTAT_RO5_OPMODE_POSITION                        0x5
#define _CANSTAT_RO5_OPMODE_SIZE                            0x3
#define _CANSTAT_RO5_OPMODE_LENGTH                          0x3
#define _CANSTAT_RO5_OPMODE_MASK                            0xE0
#define _CANSTAT_RO5_EICODE1_POSN                           0x1
#define _CANSTAT_RO5_EICODE1_POSITION                       0x1
#define _CANSTAT_RO5_EICODE1_SIZE                           0x1
#define _CANSTAT_RO5_EICODE1_LENGTH                         0x1
#define _CANSTAT_RO5_EICODE1_MASK                           0x2
#define _CANSTAT_RO5_EICODE2_POSN                           0x2
#define _CANSTAT_RO5_EICODE2_POSITION                       0x2
#define _CANSTAT_RO5_EICODE2_SIZE                           0x1
#define _CANSTAT_RO5_EICODE2_LENGTH                         0x1
#define _CANSTAT_RO5_EICODE2_MASK                           0x4
#define _CANSTAT_RO5_EICODE3_POSN                           0x3
#define _CANSTAT_RO5_EICODE3_POSITION                       0x3
#define _CANSTAT_RO5_EICODE3_SIZE                           0x1
#define _CANSTAT_RO5_EICODE3_LENGTH                         0x1
#define _CANSTAT_RO5_EICODE3_MASK                           0x8
#define _CANSTAT_RO5_OPMODE0_POSN                           0x5
#define _CANSTAT_RO5_OPMODE0_POSITION                       0x5
#define _CANSTAT_RO5_OPMODE0_SIZE                           0x1
#define _CANSTAT_RO5_OPMODE0_LENGTH                         0x1
#define _CANSTAT_RO5_OPMODE0_MASK                           0x20
#define _CANSTAT_RO5_OPMODE1_POSN                           0x6
#define _CANSTAT_RO5_OPMODE1_POSITION                       0x6
#define _CANSTAT_RO5_OPMODE1_SIZE                           0x1
#define _CANSTAT_RO5_OPMODE1_LENGTH                         0x1
#define _CANSTAT_RO5_OPMODE1_MASK                           0x40
#define _CANSTAT_RO5_OPMODE2_POSN                           0x7
#define _CANSTAT_RO5_OPMODE2_POSITION                       0x7
#define _CANSTAT_RO5_OPMODE2_SIZE                           0x1
#define _CANSTAT_RO5_OPMODE2_LENGTH                         0x1
#define _CANSTAT_RO5_OPMODE2_MASK                           0x80
#define _CANSTAT_RO5_ICODE0_POSN                            0x1
#define _CANSTAT_RO5_ICODE0_POSITION                        0x1
#define _CANSTAT_RO5_ICODE0_SIZE                            0x1
#define _CANSTAT_RO5_ICODE0_LENGTH                          0x1
#define _CANSTAT_RO5_ICODE0_MASK                            0x2
#define _CANSTAT_RO5_ICODE1_POSN                            0x2
#define _CANSTAT_RO5_ICODE1_POSITION                        0x2
#define _CANSTAT_RO5_ICODE1_SIZE                            0x1
#define _CANSTAT_RO5_ICODE1_LENGTH                          0x1
#define _CANSTAT_RO5_ICODE1_MASK                            0x4
#define _CANSTAT_RO5_ICODE2_POSN                            0x3
#define _CANSTAT_RO5_ICODE2_POSITION                        0x3
#define _CANSTAT_RO5_ICODE2_SIZE                            0x1
#define _CANSTAT_RO5_ICODE2_LENGTH                          0x1
#define _CANSTAT_RO5_ICODE2_MASK                            0x8

// Register: CANCON_RO5
#define CANCON_RO5 CANCON_RO5
extern volatile unsigned char           CANCON_RO5          __at(0xECF);
#ifndef _LIB_BUILD
asm("CANCON_RO5 equ 0ECFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FP0                    :1;
        unsigned WIN0_FP1               :1;
        unsigned WIN1_FP2               :1;
        unsigned WIN2_FP3               :1;
        unsigned ABAT                   :1;
        unsigned REQOP                  :3;
    };
    struct {
        unsigned                        :1;
        unsigned WIN0                   :1;
        unsigned WIN1                   :1;
        unsigned WIN2                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned FP1                    :1;
        unsigned FP2                    :1;
        unsigned FP3                    :1;
    };
} CANCON_RO5bits_t;
