MikroElektronika/core_packages/PIC/XC8/def/PIC18LF45K80/mcu.h
extern volatile B5D6bits_t B5D6bits __at(0xEDC);
// bitfield macros
#define _B5D6_B5D6_POSN                                     0x0
#define _B5D6_B5D6_POSITION                                 0x0
#define _B5D6_B5D6_SIZE                                     0x8
#define _B5D6_B5D6_LENGTH                                   0x8
#define _B5D6_B5D6_MASK                                     0xFF
#define _B5D6_B5D60_POSN                                    0x0
#define _B5D6_B5D60_POSITION                                0x0
#define _B5D6_B5D60_SIZE                                    0x1
#define _B5D6_B5D60_LENGTH                                  0x1
#define _B5D6_B5D60_MASK                                    0x1
#define _B5D6_B5D61_POSN                                    0x1
#define _B5D6_B5D61_POSITION                                0x1
#define _B5D6_B5D61_SIZE                                    0x1
#define _B5D6_B5D61_LENGTH                                  0x1
#define _B5D6_B5D61_MASK                                    0x2
#define _B5D6_B5D62_POSN                                    0x2
#define _B5D6_B5D62_POSITION                                0x2
#define _B5D6_B5D62_SIZE                                    0x1
#define _B5D6_B5D62_LENGTH                                  0x1
#define _B5D6_B5D62_MASK                                    0x4
#define _B5D6_B5D63_POSN                                    0x3
#define _B5D6_B5D63_POSITION                                0x3
#define _B5D6_B5D63_SIZE                                    0x1
#define _B5D6_B5D63_LENGTH                                  0x1
#define _B5D6_B5D63_MASK                                    0x8
#define _B5D6_B5D64_POSN                                    0x4
#define _B5D6_B5D64_POSITION                                0x4
#define _B5D6_B5D64_SIZE                                    0x1
#define _B5D6_B5D64_LENGTH                                  0x1
#define _B5D6_B5D64_MASK                                    0x10
#define _B5D6_B5D65_POSN                                    0x5
#define _B5D6_B5D65_POSITION                                0x5
#define _B5D6_B5D65_SIZE                                    0x1
#define _B5D6_B5D65_LENGTH                                  0x1
#define _B5D6_B5D65_MASK                                    0x20
#define _B5D6_B5D66_POSN                                    0x6
#define _B5D6_B5D66_POSITION                                0x6
#define _B5D6_B5D66_SIZE                                    0x1
#define _B5D6_B5D66_LENGTH                                  0x1
#define _B5D6_B5D66_MASK                                    0x40
#define _B5D6_B5D67_POSN                                    0x7
#define _B5D6_B5D67_POSITION                                0x7
#define _B5D6_B5D67_SIZE                                    0x1
#define _B5D6_B5D67_LENGTH                                  0x1
#define _B5D6_B5D67_MASK                                    0x80

// Register: B5D7
#define B5D7 B5D7
extern volatile unsigned char           B5D7                __at(0xEDD);
#ifndef _LIB_BUILD
asm("B5D7 equ 0EDDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B5D7                   :8;
    };
    struct {
        unsigned B5D70                  :1;
        unsigned B5D71                  :1;
        unsigned B5D72                  :1;
        unsigned B5D73                  :1;
        unsigned B5D74                  :1;
        unsigned B5D75                  :1;
        unsigned B5D76                  :1;
        unsigned B5D77                  :1;
    };
} B5D7bits_t;
extern volatile B5D7bits_t B5D7bits __at(0xEDD);
// bitfield macros
#define _B5D7_B5D7_POSN                                     0x0
#define _B5D7_B5D7_POSITION                                 0x0
#define _B5D7_B5D7_SIZE                                     0x8
#define _B5D7_B5D7_LENGTH                                   0x8
#define _B5D7_B5D7_MASK                                     0xFF
#define _B5D7_B5D70_POSN                                    0x0
#define _B5D7_B5D70_POSITION                                0x0
#define _B5D7_B5D70_SIZE                                    0x1
#define _B5D7_B5D70_LENGTH                                  0x1
#define _B5D7_B5D70_MASK                                    0x1
#define _B5D7_B5D71_POSN                                    0x1
#define _B5D7_B5D71_POSITION                                0x1
#define _B5D7_B5D71_SIZE                                    0x1
#define _B5D7_B5D71_LENGTH                                  0x1
#define _B5D7_B5D71_MASK                                    0x2
#define _B5D7_B5D72_POSN                                    0x2
#define _B5D7_B5D72_POSITION                                0x2
#define _B5D7_B5D72_SIZE                                    0x1
#define _B5D7_B5D72_LENGTH                                  0x1
#define _B5D7_B5D72_MASK                                    0x4
#define _B5D7_B5D73_POSN                                    0x3
#define _B5D7_B5D73_POSITION                                0x3
#define _B5D7_B5D73_SIZE                                    0x1
#define _B5D7_B5D73_LENGTH                                  0x1
#define _B5D7_B5D73_MASK                                    0x8
#define _B5D7_B5D74_POSN                                    0x4
#define _B5D7_B5D74_POSITION                                0x4
#define _B5D7_B5D74_SIZE                                    0x1
#define _B5D7_B5D74_LENGTH                                  0x1
#define _B5D7_B5D74_MASK                                    0x10
#define _B5D7_B5D75_POSN                                    0x5
#define _B5D7_B5D75_POSITION                                0x5
#define _B5D7_B5D75_SIZE                                    0x1
#define _B5D7_B5D75_LENGTH                                  0x1
#define _B5D7_B5D75_MASK                                    0x20
#define _B5D7_B5D76_POSN                                    0x6
#define _B5D7_B5D76_POSITION                                0x6
#define _B5D7_B5D76_SIZE                                    0x1
#define _B5D7_B5D76_LENGTH                                  0x1
#define _B5D7_B5D76_MASK                                    0x40
#define _B5D7_B5D77_POSN                                    0x7
#define _B5D7_B5D77_POSITION                                0x7
#define _B5D7_B5D77_SIZE                                    0x1
#define _B5D7_B5D77_LENGTH                                  0x1
#define _B5D7_B5D77_MASK                                    0x80

// Register: CANSTAT_RO4
#define CANSTAT_RO4 CANSTAT_RO4
extern volatile unsigned char           CANSTAT_RO4         __at(0xEDE);
#ifndef _LIB_BUILD
asm("CANSTAT_RO4 equ 0EDEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EICODE0                :1;
        unsigned EICODE1_ICODE0         :1;
        unsigned EICODE2_ICODE1         :1;
        unsigned EICODE3_ICODE2         :1;
        unsigned EICODE4                :1;
        unsigned OPMODE                 :3;
    };
    struct {
        unsigned                        :1;
        unsigned EICODE1                :1;
        unsigned EICODE2                :1;
        unsigned EICODE3                :1;
        unsigned                        :1;
        unsigned OPMODE0                :1;
        unsigned OPMODE1                :1;
        unsigned OPMODE2                :1;
    };
    struct {
        unsigned                        :1;
        unsigned ICODE0                 :1;
        unsigned ICODE1                 :1;
        unsigned ICODE2                 :1;
    };
} CANSTAT_RO4bits_t;
extern volatile CANSTAT_RO4bits_t CANSTAT_RO4bits __at(0xEDE);
// bitfield macros
#define _CANSTAT_RO4_EICODE0_POSN                           0x0
#define _CANSTAT_RO4_EICODE0_POSITION                       0x0
#define _CANSTAT_RO4_EICODE0_SIZE                           0x1
#define _CANSTAT_RO4_EICODE0_LENGTH                         0x1
#define _CANSTAT_RO4_EICODE0_MASK                           0x1
#define _CANSTAT_RO4_EICODE1_ICODE0_POSN                    0x1
#define _CANSTAT_RO4_EICODE1_ICODE0_POSITION                0x1
#define _CANSTAT_RO4_EICODE1_ICODE0_SIZE                    0x1
#define _CANSTAT_RO4_EICODE1_ICODE0_LENGTH                  0x1
#define _CANSTAT_RO4_EICODE1_ICODE0_MASK                    0x2
#define _CANSTAT_RO4_EICODE2_ICODE1_POSN                    0x2
#define _CANSTAT_RO4_EICODE2_ICODE1_POSITION                0x2
#define _CANSTAT_RO4_EICODE2_ICODE1_SIZE                    0x1
#define _CANSTAT_RO4_EICODE2_ICODE1_LENGTH                  0x1
#define _CANSTAT_RO4_EICODE2_ICODE1_MASK                    0x4
#define _CANSTAT_RO4_EICODE3_ICODE2_POSN                    0x3
#define _CANSTAT_RO4_EICODE3_ICODE2_POSITION                0x3
#define _CANSTAT_RO4_EICODE3_ICODE2_SIZE                    0x1
#define _CANSTAT_RO4_EICODE3_ICODE2_LENGTH                  0x1
#define _CANSTAT_RO4_EICODE3_ICODE2_MASK                    0x8
#define _CANSTAT_RO4_EICODE4_POSN                           0x4
#define _CANSTAT_RO4_EICODE4_POSITION                       0x4
#define _CANSTAT_RO4_EICODE4_SIZE                           0x1
#define _CANSTAT_RO4_EICODE4_LENGTH                         0x1
#define _CANSTAT_RO4_EICODE4_MASK                           0x10
#define _CANSTAT_RO4_OPMODE_POSN                            0x5
#define _CANSTAT_RO4_OPMODE_POSITION                        0x5
#define _CANSTAT_RO4_OPMODE_SIZE                            0x3
#define _CANSTAT_RO4_OPMODE_LENGTH                          0x3
#define _CANSTAT_RO4_OPMODE_MASK                            0xE0
#define _CANSTAT_RO4_EICODE1_POSN                           0x1
#define _CANSTAT_RO4_EICODE1_POSITION                       0x1
#define _CANSTAT_RO4_EICODE1_SIZE                           0x1
#define _CANSTAT_RO4_EICODE1_LENGTH                         0x1
#define _CANSTAT_RO4_EICODE1_MASK                           0x2
#define _CANSTAT_RO4_EICODE2_POSN                           0x2
#define _CANSTAT_RO4_EICODE2_POSITION                       0x2
#define _CANSTAT_RO4_EICODE2_SIZE                           0x1
#define _CANSTAT_RO4_EICODE2_LENGTH                         0x1
#define _CANSTAT_RO4_EICODE2_MASK                           0x4
#define _CANSTAT_RO4_EICODE3_POSN                           0x3
#define _CANSTAT_RO4_EICODE3_POSITION                       0x3
#define _CANSTAT_RO4_EICODE3_SIZE                           0x1
#define _CANSTAT_RO4_EICODE3_LENGTH                         0x1
#define _CANSTAT_RO4_EICODE3_MASK                           0x8
#define _CANSTAT_RO4_OPMODE0_POSN                           0x5
#define _CANSTAT_RO4_OPMODE0_POSITION                       0x5
#define _CANSTAT_RO4_OPMODE0_SIZE                           0x1
#define _CANSTAT_RO4_OPMODE0_LENGTH                         0x1
#define _CANSTAT_RO4_OPMODE0_MASK                           0x20
#define _CANSTAT_RO4_OPMODE1_POSN                           0x6
#define _CANSTAT_RO4_OPMODE1_POSITION                       0x6
#define _CANSTAT_RO4_OPMODE1_SIZE                           0x1
#define _CANSTAT_RO4_OPMODE1_LENGTH                         0x1
#define _CANSTAT_RO4_OPMODE1_MASK                           0x40
#define _CANSTAT_RO4_OPMODE2_POSN                           0x7
#define _CANSTAT_RO4_OPMODE2_POSITION                       0x7
#define _CANSTAT_RO4_OPMODE2_SIZE                           0x1
#define _CANSTAT_RO4_OPMODE2_LENGTH                         0x1
#define _CANSTAT_RO4_OPMODE2_MASK                           0x80
#define _CANSTAT_RO4_ICODE0_POSN                            0x1
#define _CANSTAT_RO4_ICODE0_POSITION                        0x1
#define _CANSTAT_RO4_ICODE0_SIZE                            0x1
#define _CANSTAT_RO4_ICODE0_LENGTH                          0x1
#define _CANSTAT_RO4_ICODE0_MASK                            0x2
#define _CANSTAT_RO4_ICODE1_POSN                            0x2
#define _CANSTAT_RO4_ICODE1_POSITION                        0x2
#define _CANSTAT_RO4_ICODE1_SIZE                            0x1
#define _CANSTAT_RO4_ICODE1_LENGTH                          0x1
#define _CANSTAT_RO4_ICODE1_MASK                            0x4
#define _CANSTAT_RO4_ICODE2_POSN                            0x3
#define _CANSTAT_RO4_ICODE2_POSITION                        0x3
#define _CANSTAT_RO4_ICODE2_SIZE                            0x1
#define _CANSTAT_RO4_ICODE2_LENGTH                          0x1
#define _CANSTAT_RO4_ICODE2_MASK                            0x8

