MikroElektronika/core_packages/PIC/XC8/def/PIC18LF45K80/mcu.h
extern volatile RXF1EIDLbits_t RXF1EIDLbits __at(0xEE7);
// bitfield macros
#define _RXF1EIDL_EID_POSN                                  0x0
#define _RXF1EIDL_EID_POSITION                              0x0
#define _RXF1EIDL_EID_SIZE                                  0x8
#define _RXF1EIDL_EID_LENGTH                                0x8
#define _RXF1EIDL_EID_MASK                                  0xFF
#define _RXF1EIDL_EID0_POSN                                 0x0
#define _RXF1EIDL_EID0_POSITION                             0x0
#define _RXF1EIDL_EID0_SIZE                                 0x1
#define _RXF1EIDL_EID0_LENGTH                               0x1
#define _RXF1EIDL_EID0_MASK                                 0x1
#define _RXF1EIDL_EID1_POSN                                 0x1
#define _RXF1EIDL_EID1_POSITION                             0x1
#define _RXF1EIDL_EID1_SIZE                                 0x1
#define _RXF1EIDL_EID1_LENGTH                               0x1
#define _RXF1EIDL_EID1_MASK                                 0x2
#define _RXF1EIDL_EID2_POSN                                 0x2
#define _RXF1EIDL_EID2_POSITION                             0x2
#define _RXF1EIDL_EID2_SIZE                                 0x1
#define _RXF1EIDL_EID2_LENGTH                               0x1
#define _RXF1EIDL_EID2_MASK                                 0x4
#define _RXF1EIDL_EID3_POSN                                 0x3
#define _RXF1EIDL_EID3_POSITION                             0x3
#define _RXF1EIDL_EID3_SIZE                                 0x1
#define _RXF1EIDL_EID3_LENGTH                               0x1
#define _RXF1EIDL_EID3_MASK                                 0x8
#define _RXF1EIDL_EID4_POSN                                 0x4
#define _RXF1EIDL_EID4_POSITION                             0x4
#define _RXF1EIDL_EID4_SIZE                                 0x1
#define _RXF1EIDL_EID4_LENGTH                               0x1
#define _RXF1EIDL_EID4_MASK                                 0x10
#define _RXF1EIDL_EID5_POSN                                 0x5
#define _RXF1EIDL_EID5_POSITION                             0x5
#define _RXF1EIDL_EID5_SIZE                                 0x1
#define _RXF1EIDL_EID5_LENGTH                               0x1
#define _RXF1EIDL_EID5_MASK                                 0x20
#define _RXF1EIDL_EID6_POSN                                 0x6
#define _RXF1EIDL_EID6_POSITION                             0x6
#define _RXF1EIDL_EID6_SIZE                                 0x1
#define _RXF1EIDL_EID6_LENGTH                               0x1
#define _RXF1EIDL_EID6_MASK                                 0x40
#define _RXF1EIDL_EID7_POSN                                 0x7
#define _RXF1EIDL_EID7_POSITION                             0x7
#define _RXF1EIDL_EID7_SIZE                                 0x1
#define _RXF1EIDL_EID7_LENGTH                               0x1
#define _RXF1EIDL_EID7_MASK                                 0x80
#define _RXF1EIDL_RXF1EID0_POSN                             0x0
#define _RXF1EIDL_RXF1EID0_POSITION                         0x0
#define _RXF1EIDL_RXF1EID0_SIZE                             0x1
#define _RXF1EIDL_RXF1EID0_LENGTH                           0x1
#define _RXF1EIDL_RXF1EID0_MASK                             0x1
#define _RXF1EIDL_RXF1EID1_POSN                             0x1
#define _RXF1EIDL_RXF1EID1_POSITION                         0x1
#define _RXF1EIDL_RXF1EID1_SIZE                             0x1
#define _RXF1EIDL_RXF1EID1_LENGTH                           0x1
#define _RXF1EIDL_RXF1EID1_MASK                             0x2
#define _RXF1EIDL_RXF1EID2_POSN                             0x2
#define _RXF1EIDL_RXF1EID2_POSITION                         0x2
#define _RXF1EIDL_RXF1EID2_SIZE                             0x1
#define _RXF1EIDL_RXF1EID2_LENGTH                           0x1
#define _RXF1EIDL_RXF1EID2_MASK                             0x4
#define _RXF1EIDL_RXF1EID3_POSN                             0x3
#define _RXF1EIDL_RXF1EID3_POSITION                         0x3
#define _RXF1EIDL_RXF1EID3_SIZE                             0x1
#define _RXF1EIDL_RXF1EID3_LENGTH                           0x1
#define _RXF1EIDL_RXF1EID3_MASK                             0x8
#define _RXF1EIDL_RXF1EID4_POSN                             0x4
#define _RXF1EIDL_RXF1EID4_POSITION                         0x4
#define _RXF1EIDL_RXF1EID4_SIZE                             0x1
#define _RXF1EIDL_RXF1EID4_LENGTH                           0x1
#define _RXF1EIDL_RXF1EID4_MASK                             0x10
#define _RXF1EIDL_RXF1EID5_POSN                             0x5
#define _RXF1EIDL_RXF1EID5_POSITION                         0x5
#define _RXF1EIDL_RXF1EID5_SIZE                             0x1
#define _RXF1EIDL_RXF1EID5_LENGTH                           0x1
#define _RXF1EIDL_RXF1EID5_MASK                             0x20
#define _RXF1EIDL_RXF1EID6_POSN                             0x6
#define _RXF1EIDL_RXF1EID6_POSITION                         0x6
#define _RXF1EIDL_RXF1EID6_SIZE                             0x1
#define _RXF1EIDL_RXF1EID6_LENGTH                           0x1
#define _RXF1EIDL_RXF1EID6_MASK                             0x40
#define _RXF1EIDL_RXF1EID7_POSN                             0x7
#define _RXF1EIDL_RXF1EID7_POSITION                         0x7
#define _RXF1EIDL_RXF1EID7_SIZE                             0x1
#define _RXF1EIDL_RXF1EID7_LENGTH                           0x1
#define _RXF1EIDL_RXF1EID7_MASK                             0x80

// Register: RXF2SIDH
#define RXF2SIDH RXF2SIDH
extern volatile unsigned char           RXF2SIDH            __at(0xEE8);
#ifndef _LIB_BUILD
asm("RXF2SIDH equ 0EE8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID                    :8;
    };
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXF2SID3               :1;
        unsigned RXF2SID4               :1;
        unsigned RXF2SID5               :1;
        unsigned RXF2SID6               :1;
        unsigned RXF2SID7               :1;
        unsigned RXF2SID8               :1;
        unsigned RXF2SID9               :1;
        unsigned RXF2SID10              :1;
    };
} RXF2SIDHbits_t;
extern volatile RXF2SIDHbits_t RXF2SIDHbits __at(0xEE8);
// bitfield macros
#define _RXF2SIDH_SID_POSN                                  0x0
#define _RXF2SIDH_SID_POSITION                              0x0
#define _RXF2SIDH_SID_SIZE                                  0x8
#define _RXF2SIDH_SID_LENGTH                                0x8
#define _RXF2SIDH_SID_MASK                                  0xFF
#define _RXF2SIDH_SID3_POSN                                 0x0
#define _RXF2SIDH_SID3_POSITION                             0x0
#define _RXF2SIDH_SID3_SIZE                                 0x1
#define _RXF2SIDH_SID3_LENGTH                               0x1
#define _RXF2SIDH_SID3_MASK                                 0x1
#define _RXF2SIDH_SID4_POSN                                 0x1
#define _RXF2SIDH_SID4_POSITION                             0x1
#define _RXF2SIDH_SID4_SIZE                                 0x1
#define _RXF2SIDH_SID4_LENGTH                               0x1
#define _RXF2SIDH_SID4_MASK                                 0x2
#define _RXF2SIDH_SID5_POSN                                 0x2
#define _RXF2SIDH_SID5_POSITION                             0x2
#define _RXF2SIDH_SID5_SIZE                                 0x1
#define _RXF2SIDH_SID5_LENGTH                               0x1
#define _RXF2SIDH_SID5_MASK                                 0x4
#define _RXF2SIDH_SID6_POSN                                 0x3
#define _RXF2SIDH_SID6_POSITION                             0x3
#define _RXF2SIDH_SID6_SIZE                                 0x1
#define _RXF2SIDH_SID6_LENGTH                               0x1
#define _RXF2SIDH_SID6_MASK                                 0x8
#define _RXF2SIDH_SID7_POSN                                 0x4
#define _RXF2SIDH_SID7_POSITION                             0x4
#define _RXF2SIDH_SID7_SIZE                                 0x1
#define _RXF2SIDH_SID7_LENGTH                               0x1
#define _RXF2SIDH_SID7_MASK                                 0x10
#define _RXF2SIDH_SID8_POSN                                 0x5
#define _RXF2SIDH_SID8_POSITION                             0x5
#define _RXF2SIDH_SID8_SIZE                                 0x1
#define _RXF2SIDH_SID8_LENGTH                               0x1
#define _RXF2SIDH_SID8_MASK                                 0x20
#define _RXF2SIDH_SID9_POSN                                 0x6
#define _RXF2SIDH_SID9_POSITION                             0x6
#define _RXF2SIDH_SID9_SIZE                                 0x1
#define _RXF2SIDH_SID9_LENGTH                               0x1
#define _RXF2SIDH_SID9_MASK                                 0x40
#define _RXF2SIDH_SID10_POSN                                0x7
#define _RXF2SIDH_SID10_POSITION                            0x7
#define _RXF2SIDH_SID10_SIZE                                0x1
#define _RXF2SIDH_SID10_LENGTH                              0x1
#define _RXF2SIDH_SID10_MASK                                0x80
#define _RXF2SIDH_RXF2SID3_POSN                             0x0
#define _RXF2SIDH_RXF2SID3_POSITION                         0x0
#define _RXF2SIDH_RXF2SID3_SIZE                             0x1
#define _RXF2SIDH_RXF2SID3_LENGTH                           0x1
#define _RXF2SIDH_RXF2SID3_MASK                             0x1
#define _RXF2SIDH_RXF2SID4_POSN                             0x1
#define _RXF2SIDH_RXF2SID4_POSITION                         0x1
#define _RXF2SIDH_RXF2SID4_SIZE                             0x1
#define _RXF2SIDH_RXF2SID4_LENGTH                           0x1
#define _RXF2SIDH_RXF2SID4_MASK                             0x2
#define _RXF2SIDH_RXF2SID5_POSN                             0x2
#define _RXF2SIDH_RXF2SID5_POSITION                         0x2
#define _RXF2SIDH_RXF2SID5_SIZE                             0x1
#define _RXF2SIDH_RXF2SID5_LENGTH                           0x1
#define _RXF2SIDH_RXF2SID5_MASK                             0x4
#define _RXF2SIDH_RXF2SID6_POSN                             0x3
#define _RXF2SIDH_RXF2SID6_POSITION                         0x3
#define _RXF2SIDH_RXF2SID6_SIZE                             0x1
#define _RXF2SIDH_RXF2SID6_LENGTH                           0x1
#define _RXF2SIDH_RXF2SID6_MASK                             0x8
#define _RXF2SIDH_RXF2SID7_POSN                             0x4
#define _RXF2SIDH_RXF2SID7_POSITION                         0x4
#define _RXF2SIDH_RXF2SID7_SIZE                             0x1
#define _RXF2SIDH_RXF2SID7_LENGTH                           0x1
#define _RXF2SIDH_RXF2SID7_MASK                             0x10
#define _RXF2SIDH_RXF2SID8_POSN                             0x5
#define _RXF2SIDH_RXF2SID8_POSITION                         0x5
#define _RXF2SIDH_RXF2SID8_SIZE                             0x1
#define _RXF2SIDH_RXF2SID8_LENGTH                           0x1
#define _RXF2SIDH_RXF2SID8_MASK                             0x20
#define _RXF2SIDH_RXF2SID9_POSN                             0x6
#define _RXF2SIDH_RXF2SID9_POSITION                         0x6
#define _RXF2SIDH_RXF2SID9_SIZE                             0x1
#define _RXF2SIDH_RXF2SID9_LENGTH                           0x1
#define _RXF2SIDH_RXF2SID9_MASK                             0x40
#define _RXF2SIDH_RXF2SID10_POSN                            0x7
#define _RXF2SIDH_RXF2SID10_POSITION                        0x7
#define _RXF2SIDH_RXF2SID10_SIZE                            0x1
#define _RXF2SIDH_RXF2SID10_LENGTH                          0x1
#define _RXF2SIDH_RXF2SID10_MASK                            0x80

// Register: RXF2SIDL
#define RXF2SIDL RXF2SIDL
extern volatile unsigned char           RXF2SIDL            __at(0xEE9);
#ifndef _LIB_BUILD
asm("RXF2SIDL equ 0EE9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :2;
        unsigned                        :1;
        unsigned EXIDEN                 :1;
        unsigned                        :1;
        unsigned SID                    :3;
    };
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :3;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned RXF2EID16              :1;
        unsigned RXF2EID17              :1;
        unsigned                        :1;
        unsigned RXF2EXIDEN             :1;
        unsigned                        :1;
        unsigned RXF2SID0               :1;
        unsigned RXF2SID1               :1;
        unsigned RXF2SID2               :1;
    };
} RXF2SIDLbits_t;
