MikroElektronika/core_packages/PIC/XC8/def/PIC18LF45K80/mcu.h
extern volatile WPUBbits_t WPUBbits __at(0xF5B);
// bitfield macros
#define _WPUB_WPUB0_POSN                                    0x0
#define _WPUB_WPUB0_POSITION                                0x0
#define _WPUB_WPUB0_SIZE                                    0x1
#define _WPUB_WPUB0_LENGTH                                  0x1
#define _WPUB_WPUB0_MASK                                    0x1
#define _WPUB_WPUB1_POSN                                    0x1
#define _WPUB_WPUB1_POSITION                                0x1
#define _WPUB_WPUB1_SIZE                                    0x1
#define _WPUB_WPUB1_LENGTH                                  0x1
#define _WPUB_WPUB1_MASK                                    0x2
#define _WPUB_WPUB2_POSN                                    0x2
#define _WPUB_WPUB2_POSITION                                0x2
#define _WPUB_WPUB2_SIZE                                    0x1
#define _WPUB_WPUB2_LENGTH                                  0x1
#define _WPUB_WPUB2_MASK                                    0x4
#define _WPUB_WPUB3_POSN                                    0x3
#define _WPUB_WPUB3_POSITION                                0x3
#define _WPUB_WPUB3_SIZE                                    0x1
#define _WPUB_WPUB3_LENGTH                                  0x1
#define _WPUB_WPUB3_MASK                                    0x8
#define _WPUB_WPUB4_POSN                                    0x4
#define _WPUB_WPUB4_POSITION                                0x4
#define _WPUB_WPUB4_SIZE                                    0x1
#define _WPUB_WPUB4_LENGTH                                  0x1
#define _WPUB_WPUB4_MASK                                    0x10
#define _WPUB_WPUB5_POSN                                    0x5
#define _WPUB_WPUB5_POSITION                                0x5
#define _WPUB_WPUB5_SIZE                                    0x1
#define _WPUB_WPUB5_LENGTH                                  0x1
#define _WPUB_WPUB5_MASK                                    0x20
#define _WPUB_WPUB6_POSN                                    0x6
#define _WPUB_WPUB6_POSITION                                0x6
#define _WPUB_WPUB6_SIZE                                    0x1
#define _WPUB_WPUB6_LENGTH                                  0x1
#define _WPUB_WPUB6_MASK                                    0x40
#define _WPUB_WPUB7_POSN                                    0x7
#define _WPUB_WPUB7_POSITION                                0x7
#define _WPUB_WPUB7_SIZE                                    0x1
#define _WPUB_WPUB7_LENGTH                                  0x1
#define _WPUB_WPUB7_MASK                                    0x80

// Register: ANCON1
#define ANCON1 ANCON1
extern volatile unsigned char           ANCON1              __at(0xF5C);
#ifndef _LIB_BUILD
asm("ANCON1 equ 0F5Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSEL8                 :1;
        unsigned ANSEL9                 :1;
        unsigned ANSEL10                :1;
        unsigned ANSEL11                :1;
        unsigned ANSEL12                :1;
        unsigned ANSEL13                :1;
        unsigned ANSEL14                :1;
    };
    struct {
        unsigned PCFG8                  :1;
        unsigned PCFG9                  :1;
        unsigned PCFG10                 :1;
        unsigned PCFG11                 :1;
        unsigned PCFG12                 :1;
        unsigned PCFG13                 :1;
        unsigned PCFG14                 :1;
    };
} ANCON1bits_t;
extern volatile ANCON1bits_t ANCON1bits __at(0xF5C);
// bitfield macros
#define _ANCON1_ANSEL8_POSN                                 0x0
#define _ANCON1_ANSEL8_POSITION                             0x0
#define _ANCON1_ANSEL8_SIZE                                 0x1
#define _ANCON1_ANSEL8_LENGTH                               0x1
#define _ANCON1_ANSEL8_MASK                                 0x1
#define _ANCON1_ANSEL9_POSN                                 0x1
#define _ANCON1_ANSEL9_POSITION                             0x1
#define _ANCON1_ANSEL9_SIZE                                 0x1
#define _ANCON1_ANSEL9_LENGTH                               0x1
#define _ANCON1_ANSEL9_MASK                                 0x2
#define _ANCON1_ANSEL10_POSN                                0x2
#define _ANCON1_ANSEL10_POSITION                            0x2
#define _ANCON1_ANSEL10_SIZE                                0x1
#define _ANCON1_ANSEL10_LENGTH                              0x1
#define _ANCON1_ANSEL10_MASK                                0x4
#define _ANCON1_ANSEL11_POSN                                0x3
#define _ANCON1_ANSEL11_POSITION                            0x3
#define _ANCON1_ANSEL11_SIZE                                0x1
#define _ANCON1_ANSEL11_LENGTH                              0x1
#define _ANCON1_ANSEL11_MASK                                0x8
#define _ANCON1_ANSEL12_POSN                                0x4
#define _ANCON1_ANSEL12_POSITION                            0x4
#define _ANCON1_ANSEL12_SIZE                                0x1
#define _ANCON1_ANSEL12_LENGTH                              0x1
#define _ANCON1_ANSEL12_MASK                                0x10
#define _ANCON1_ANSEL13_POSN                                0x5
#define _ANCON1_ANSEL13_POSITION                            0x5
#define _ANCON1_ANSEL13_SIZE                                0x1
#define _ANCON1_ANSEL13_LENGTH                              0x1
#define _ANCON1_ANSEL13_MASK                                0x20
#define _ANCON1_ANSEL14_POSN                                0x6
#define _ANCON1_ANSEL14_POSITION                            0x6
#define _ANCON1_ANSEL14_SIZE                                0x1
#define _ANCON1_ANSEL14_LENGTH                              0x1
#define _ANCON1_ANSEL14_MASK                                0x40
#define _ANCON1_PCFG8_POSN                                  0x0
#define _ANCON1_PCFG8_POSITION                              0x0
#define _ANCON1_PCFG8_SIZE                                  0x1
#define _ANCON1_PCFG8_LENGTH                                0x1
#define _ANCON1_PCFG8_MASK                                  0x1
#define _ANCON1_PCFG9_POSN                                  0x1
#define _ANCON1_PCFG9_POSITION                              0x1
#define _ANCON1_PCFG9_SIZE                                  0x1
#define _ANCON1_PCFG9_LENGTH                                0x1
#define _ANCON1_PCFG9_MASK                                  0x2
#define _ANCON1_PCFG10_POSN                                 0x2
#define _ANCON1_PCFG10_POSITION                             0x2
#define _ANCON1_PCFG10_SIZE                                 0x1
#define _ANCON1_PCFG10_LENGTH                               0x1
#define _ANCON1_PCFG10_MASK                                 0x4
#define _ANCON1_PCFG11_POSN                                 0x3
#define _ANCON1_PCFG11_POSITION                             0x3
#define _ANCON1_PCFG11_SIZE                                 0x1
#define _ANCON1_PCFG11_LENGTH                               0x1
#define _ANCON1_PCFG11_MASK                                 0x8
#define _ANCON1_PCFG12_POSN                                 0x4
#define _ANCON1_PCFG12_POSITION                             0x4
#define _ANCON1_PCFG12_SIZE                                 0x1
#define _ANCON1_PCFG12_LENGTH                               0x1
#define _ANCON1_PCFG12_MASK                                 0x10
#define _ANCON1_PCFG13_POSN                                 0x5
#define _ANCON1_PCFG13_POSITION                             0x5
#define _ANCON1_PCFG13_SIZE                                 0x1
#define _ANCON1_PCFG13_LENGTH                               0x1
#define _ANCON1_PCFG13_MASK                                 0x20
#define _ANCON1_PCFG14_POSN                                 0x6
#define _ANCON1_PCFG14_POSITION                             0x6
#define _ANCON1_PCFG14_SIZE                                 0x1
#define _ANCON1_PCFG14_LENGTH                               0x1
#define _ANCON1_PCFG14_MASK                                 0x40

