MikroElektronika/core_packages/PIC/XC8/def/PIC18LF45K80/mcu.h
#define                                 B3EID7_bit          _BIT_ACCESS(B3EIDL,7)
// B3EIDH<B3EID8>
extern volatile __bit                   B3EID8              __at(0x7598);	// @ (0xEB3 * 8 + 0)
#define                                 B3EID8_bit          _BIT_ACCESS(B3EIDH,0)
// B3EIDH<B3EID9>
extern volatile __bit                   B3EID9              __at(0x7599);	// @ (0xEB3 * 8 + 1)
#define                                 B3EID9_bit          _BIT_ACCESS(B3EIDH,1)
// B3SIDL<B3EXID>
extern volatile __bit                   B3EXID              __at(0x7593);	// @ (0xEB2 * 8 + 3)
#define                                 B3EXID_bit          _BIT_ACCESS(B3SIDL,3)
// B3SIDL<B3EXIDE>
extern volatile __bit                   B3EXIDE             __at(0x7593);	// @ (0xEB2 * 8 + 3)
#define                                 B3EXIDE_bit         _BIT_ACCESS(B3SIDL,3)
// B3CON<B3FILHIT0>
extern volatile __bit                   B3FILHIT0           __at(0x7580);	// @ (0xEB0 * 8 + 0)
#define                                 B3FILHIT0_bit       _BIT_ACCESS(B3CON,0)
// B3CON<B3FILHIT1>
extern volatile __bit                   B3FILHIT1           __at(0x7581);	// @ (0xEB0 * 8 + 1)
#define                                 B3FILHIT1_bit       _BIT_ACCESS(B3CON,1)
// B3CON<B3FILHIT2>
extern volatile __bit                   B3FILHIT2           __at(0x7582);	// @ (0xEB0 * 8 + 2)
#define                                 B3FILHIT2_bit       _BIT_ACCESS(B3CON,2)
// B3CON<B3FILHIT3>
extern volatile __bit                   B3FILHIT3           __at(0x7583);	// @ (0xEB0 * 8 + 3)
#define                                 B3FILHIT3_bit       _BIT_ACCESS(B3CON,3)
// B3CON<B3FILHIT4>
extern volatile __bit                   B3FILHIT4           __at(0x7584);	// @ (0xEB0 * 8 + 4)
#define                                 B3FILHIT4_bit       _BIT_ACCESS(B3CON,4)
// BIE0<B3IE>
extern volatile __bit                   B3IE                __at(0x73F5);	// @ (0xE7E * 8 + 5)
#define                                 B3IE_bit            _BIT_ACCESS(BIE0,5)
// B3DLC<B3RB0>
extern volatile __bit                   B3RB0               __at(0x75AC);	// @ (0xEB5 * 8 + 4)
#define                                 B3RB0_bit           _BIT_ACCESS(B3DLC,4)
// B3DLC<B3RB1>
extern volatile __bit                   B3RB1               __at(0x75AD);	// @ (0xEB5 * 8 + 5)
#define                                 B3RB1_bit           _BIT_ACCESS(B3DLC,5)
// B3CON<B3RTREN>
extern volatile __bit                   B3RTREN             __at(0x7582);	// @ (0xEB0 * 8 + 2)
#define                                 B3RTREN_bit         _BIT_ACCESS(B3CON,2)
// B3CON<B3RTRRO>
extern volatile __bit                   B3RTRRO             __at(0x7585);	// @ (0xEB0 * 8 + 5)
#define                                 B3RTRRO_bit         _BIT_ACCESS(B3CON,5)
// B3CON<B3RXFUL>
extern volatile __bit                   B3RXFUL             __at(0x7587);	// @ (0xEB0 * 8 + 7)
#define                                 B3RXFUL_bit         _BIT_ACCESS(B3CON,7)
// B3CON<B3RXM1>
extern volatile __bit                   B3RXM1              __at(0x7586);	// @ (0xEB0 * 8 + 6)
#define                                 B3RXM1_bit          _BIT_ACCESS(B3CON,6)
// B3DLC<B3RXRTR>
extern volatile __bit                   B3RXRTR             __at(0x75AE);	// @ (0xEB5 * 8 + 6)
#define                                 B3RXRTR_bit         _BIT_ACCESS(B3DLC,6)
// B3SIDL<B3SID0>
extern volatile __bit                   B3SID0              __at(0x7595);	// @ (0xEB2 * 8 + 5)
#define                                 B3SID0_bit          _BIT_ACCESS(B3SIDL,5)
// B3SIDL<B3SID1>
extern volatile __bit                   B3SID1              __at(0x7596);	// @ (0xEB2 * 8 + 6)
#define                                 B3SID1_bit          _BIT_ACCESS(B3SIDL,6)
// B3SIDH<B3SID10>
extern volatile __bit                   B3SID10             __at(0x758F);	// @ (0xEB1 * 8 + 7)
#define                                 B3SID10_bit         _BIT_ACCESS(B3SIDH,7)
// B3SIDL<B3SID2>
extern volatile __bit                   B3SID2              __at(0x7597);	// @ (0xEB2 * 8 + 7)
#define                                 B3SID2_bit          _BIT_ACCESS(B3SIDL,7)
// B3SIDH<B3SID3>
extern volatile __bit                   B3SID3              __at(0x7588);	// @ (0xEB1 * 8 + 0)
#define                                 B3SID3_bit          _BIT_ACCESS(B3SIDH,0)
// B3SIDH<B3SID4>
extern volatile __bit                   B3SID4              __at(0x7589);	// @ (0xEB1 * 8 + 1)
#define                                 B3SID4_bit          _BIT_ACCESS(B3SIDH,1)
// B3SIDH<B3SID5>
extern volatile __bit                   B3SID5              __at(0x758A);	// @ (0xEB1 * 8 + 2)
#define                                 B3SID5_bit          _BIT_ACCESS(B3SIDH,2)
// B3SIDH<B3SID6>
extern volatile __bit                   B3SID6              __at(0x758B);	// @ (0xEB1 * 8 + 3)
#define                                 B3SID6_bit          _BIT_ACCESS(B3SIDH,3)
// B3SIDH<B3SID7>
extern volatile __bit                   B3SID7              __at(0x758C);	// @ (0xEB1 * 8 + 4)
#define                                 B3SID7_bit          _BIT_ACCESS(B3SIDH,4)
// B3SIDH<B3SID8>
extern volatile __bit                   B3SID8              __at(0x758D);	// @ (0xEB1 * 8 + 5)
#define                                 B3SID8_bit          _BIT_ACCESS(B3SIDH,5)
// B3SIDH<B3SID9>
extern volatile __bit                   B3SID9              __at(0x758E);	// @ (0xEB1 * 8 + 6)
#define                                 B3SID9_bit          _BIT_ACCESS(B3SIDH,6)
// B3SIDL<B3SRR>
extern volatile __bit                   B3SRR               __at(0x7594);	// @ (0xEB2 * 8 + 4)
#define                                 B3SRR_bit           _BIT_ACCESS(B3SIDL,4)
// B3CON<B3TXABT>
extern volatile __bit                   B3TXABT             __at(0x7586);	// @ (0xEB0 * 8 + 6)
#define                                 B3TXABT_bit         _BIT_ACCESS(B3CON,6)
// B3CON<B3TXB3IF>
extern volatile __bit                   B3TXB3IF            __at(0x7587);	// @ (0xEB0 * 8 + 7)
#define                                 B3TXB3IF_bit        _BIT_ACCESS(B3CON,7)
// BSEL0<B3TXEN>
extern volatile __bit                   B3TXEN              __at(0x73ED);	// @ (0xE7D * 8 + 5)
#define                                 B3TXEN_bit          _BIT_ACCESS(BSEL0,5)
// B3CON<B3TXERR>
extern volatile __bit                   B3TXERR             __at(0x7584);	// @ (0xEB0 * 8 + 4)
#define                                 B3TXERR_bit         _BIT_ACCESS(B3CON,4)
// B3CON<B3TXLARB>
extern volatile __bit                   B3TXLARB            __at(0x7585);	// @ (0xEB0 * 8 + 5)
#define                                 B3TXLARB_bit        _BIT_ACCESS(B3CON,5)
// B3CON<B3TXPRI0>
extern volatile __bit                   B3TXPRI0            __at(0x7580);	// @ (0xEB0 * 8 + 0)
#define                                 B3TXPRI0_bit        _BIT_ACCESS(B3CON,0)
// B3CON<B3TXPRI1>
extern volatile __bit                   B3TXPRI1            __at(0x7581);	// @ (0xEB0 * 8 + 1)
#define                                 B3TXPRI1_bit        _BIT_ACCESS(B3CON,1)
// B3CON<B3TXREQ>
extern volatile __bit                   B3TXREQ             __at(0x7583);	// @ (0xEB0 * 8 + 3)
#define                                 B3TXREQ_bit         _BIT_ACCESS(B3CON,3)
// B4D0<B4D00>
extern volatile __bit                   B4D00               __at(0x7630);	// @ (0xEC6 * 8 + 0)
#define                                 B4D00_bit           _BIT_ACCESS(B4D0,0)
// B4D0<B4D01>
extern volatile __bit                   B4D01               __at(0x7631);	// @ (0xEC6 * 8 + 1)
#define                                 B4D01_bit           _BIT_ACCESS(B4D0,1)
// B4D0<B4D02>
extern volatile __bit                   B4D02               __at(0x7632);	// @ (0xEC6 * 8 + 2)
#define                                 B4D02_bit           _BIT_ACCESS(B4D0,2)
// B4D0<B4D03>
extern volatile __bit                   B4D03               __at(0x7633);	// @ (0xEC6 * 8 + 3)
#define                                 B4D03_bit           _BIT_ACCESS(B4D0,3)
// B4D0<B4D04>
extern volatile __bit                   B4D04               __at(0x7634);	// @ (0xEC6 * 8 + 4)
#define                                 B4D04_bit           _BIT_ACCESS(B4D0,4)
// B4D0<B4D05>
extern volatile __bit                   B4D05               __at(0x7635);	// @ (0xEC6 * 8 + 5)
#define                                 B4D05_bit           _BIT_ACCESS(B4D0,5)
// B4D0<B4D06>
extern volatile __bit                   B4D06               __at(0x7636);	// @ (0xEC6 * 8 + 6)
#define                                 B4D06_bit           _BIT_ACCESS(B4D0,6)
// B4D0<B4D07>
extern volatile __bit                   B4D07               __at(0x7637);	// @ (0xEC6 * 8 + 7)
#define                                 B4D07_bit           _BIT_ACCESS(B4D0,7)
// B4D1<B4D10>
extern volatile __bit                   B4D10               __at(0x7638);	// @ (0xEC7 * 8 + 0)
#define                                 B4D10_bit           _BIT_ACCESS(B4D1,0)
// B4D1<B4D11>
extern volatile __bit                   B4D11               __at(0x7639);	// @ (0xEC7 * 8 + 1)
#define                                 B4D11_bit           _BIT_ACCESS(B4D1,1)
// B4D1<B4D12>
extern volatile __bit                   B4D12               __at(0x763A);	// @ (0xEC7 * 8 + 2)
#define                                 B4D12_bit           _BIT_ACCESS(B4D1,2)
// B4D1<B4D13>
extern volatile __bit                   B4D13               __at(0x763B);	// @ (0xEC7 * 8 + 3)
#define                                 B4D13_bit           _BIT_ACCESS(B4D1,3)
// B4D1<B4D14>
extern volatile __bit                   B4D14               __at(0x763C);	// @ (0xEC7 * 8 + 4)
#define                                 B4D14_bit           _BIT_ACCESS(B4D1,4)
// B4D1<B4D15>
extern volatile __bit                   B4D15               __at(0x763D);	// @ (0xEC7 * 8 + 5)
#define                                 B4D15_bit           _BIT_ACCESS(B4D1,5)
// B4D1<B4D16>
extern volatile __bit                   B4D16               __at(0x763E);	// @ (0xEC7 * 8 + 6)
#define                                 B4D16_bit           _BIT_ACCESS(B4D1,6)
// B4D1<B4D17>
extern volatile __bit                   B4D17               __at(0x763F);	// @ (0xEC7 * 8 + 7)
#define                                 B4D17_bit           _BIT_ACCESS(B4D1,7)
// B4D2<B4D20>
extern volatile __bit                   B4D20               __at(0x7640);	// @ (0xEC8 * 8 + 0)
#define                                 B4D20_bit           _BIT_ACCESS(B4D2,0)
// B4D2<B4D21>
extern volatile __bit                   B4D21               __at(0x7641);	// @ (0xEC8 * 8 + 1)
#define                                 B4D21_bit           _BIT_ACCESS(B4D2,1)
// B4D2<B4D22>
extern volatile __bit                   B4D22               __at(0x7642);	// @ (0xEC8 * 8 + 2)
#define                                 B4D22_bit           _BIT_ACCESS(B4D2,2)
// B4D2<B4D23>
extern volatile __bit                   B4D23               __at(0x7643);	// @ (0xEC8 * 8 + 3)
#define                                 B4D23_bit           _BIT_ACCESS(B4D2,3)
// B4D2<B4D24>
extern volatile __bit                   B4D24               __at(0x7644);	// @ (0xEC8 * 8 + 4)
#define                                 B4D24_bit           _BIT_ACCESS(B4D2,4)
// B4D2<B4D25>
extern volatile __bit                   B4D25               __at(0x7645);	// @ (0xEC8 * 8 + 5)
#define                                 B4D25_bit           _BIT_ACCESS(B4D2,5)
// B4D2<B4D26>
extern volatile __bit                   B4D26               __at(0x7646);	// @ (0xEC8 * 8 + 6)
#define                                 B4D26_bit           _BIT_ACCESS(B4D2,6)
// B4D2<B4D27>
extern volatile __bit                   B4D27               __at(0x7647);	// @ (0xEC8 * 8 + 7)
#define                                 B4D27_bit           _BIT_ACCESS(B4D2,7)
// B4D3<B4D30>
extern volatile __bit                   B4D30               __at(0x7648);	// @ (0xEC9 * 8 + 0)
#define                                 B4D30_bit           _BIT_ACCESS(B4D3,0)
// B4D3<B4D31>
extern volatile __bit                   B4D31               __at(0x7649);	// @ (0xEC9 * 8 + 1)
#define                                 B4D31_bit           _BIT_ACCESS(B4D3,1)
// B4D3<B4D32>
extern volatile __bit                   B4D32               __at(0x764A);	// @ (0xEC9 * 8 + 2)
#define                                 B4D32_bit           _BIT_ACCESS(B4D3,2)
// B4D3<B4D33>
extern volatile __bit                   B4D33               __at(0x764B);	// @ (0xEC9 * 8 + 3)
#define                                 B4D33_bit           _BIT_ACCESS(B4D3,3)
// B4D3<B4D34>
extern volatile __bit                   B4D34               __at(0x764C);	// @ (0xEC9 * 8 + 4)
#define                                 B4D34_bit           _BIT_ACCESS(B4D3,4)
// B4D3<B4D35>
extern volatile __bit                   B4D35               __at(0x764D);	// @ (0xEC9 * 8 + 5)
#define                                 B4D35_bit           _BIT_ACCESS(B4D3,5)
// B4D3<B4D36>
extern volatile __bit                   B4D36               __at(0x764E);	// @ (0xEC9 * 8 + 6)
#define                                 B4D36_bit           _BIT_ACCESS(B4D3,6)
// B4D3<B4D37>
extern volatile __bit                   B4D37               __at(0x764F);	// @ (0xEC9 * 8 + 7)
#define                                 B4D37_bit           _BIT_ACCESS(B4D3,7)
// B4D4<B4D40>
extern volatile __bit                   B4D40               __at(0x7650);	// @ (0xECA * 8 + 0)
#define                                 B4D40_bit           _BIT_ACCESS(B4D4,0)
// B4D4<B4D41>
extern volatile __bit                   B4D41               __at(0x7651);	// @ (0xECA * 8 + 1)
#define                                 B4D41_bit           _BIT_ACCESS(B4D4,1)
// B4D4<B4D42>
extern volatile __bit                   B4D42               __at(0x7652);	// @ (0xECA * 8 + 2)
#define                                 B4D42_bit           _BIT_ACCESS(B4D4,2)
// B4D4<B4D43>
extern volatile __bit                   B4D43               __at(0x7653);	// @ (0xECA * 8 + 3)
#define                                 B4D43_bit           _BIT_ACCESS(B4D4,3)
// B4D4<B4D44>
extern volatile __bit                   B4D44               __at(0x7654);	// @ (0xECA * 8 + 4)
#define                                 B4D44_bit           _BIT_ACCESS(B4D4,4)
// B4D4<B4D45>
extern volatile __bit                   B4D45               __at(0x7655);	// @ (0xECA * 8 + 5)
#define                                 B4D45_bit           _BIT_ACCESS(B4D4,5)
// B4D4<B4D46>
extern volatile __bit                   B4D46               __at(0x7656);	// @ (0xECA * 8 + 6)
#define                                 B4D46_bit           _BIT_ACCESS(B4D4,6)
// B4D4<B4D47>
extern volatile __bit                   B4D47               __at(0x7657);	// @ (0xECA * 8 + 7)
#define                                 B4D47_bit           _BIT_ACCESS(B4D4,7)
// B4D5<B4D50>
extern volatile __bit                   B4D50               __at(0x7658);	// @ (0xECB * 8 + 0)
#define                                 B4D50_bit           _BIT_ACCESS(B4D5,0)
// B4D5<B4D51>
extern volatile __bit                   B4D51               __at(0x7659);	// @ (0xECB * 8 + 1)
#define                                 B4D51_bit           _BIT_ACCESS(B4D5,1)
// B4D5<B4D52>
extern volatile __bit                   B4D52               __at(0x765A);	// @ (0xECB * 8 + 2)
#define                                 B4D52_bit           _BIT_ACCESS(B4D5,2)
// B4D5<B4D53>
extern volatile __bit                   B4D53               __at(0x765B);	// @ (0xECB * 8 + 3)
#define                                 B4D53_bit           _BIT_ACCESS(B4D5,3)
// B4D5<B4D54>
extern volatile __bit                   B4D54               __at(0x765C);	// @ (0xECB * 8 + 4)
#define                                 B4D54_bit           _BIT_ACCESS(B4D5,4)
// B4D5<B4D55>
extern volatile __bit                   B4D55               __at(0x765D);	// @ (0xECB * 8 + 5)
#define                                 B4D55_bit           _BIT_ACCESS(B4D5,5)
// B4D5<B4D56>
extern volatile __bit                   B4D56               __at(0x765E);	// @ (0xECB * 8 + 6)
#define                                 B4D56_bit           _BIT_ACCESS(B4D5,6)
// B4D5<B4D57>
extern volatile __bit                   B4D57               __at(0x765F);	// @ (0xECB * 8 + 7)
#define                                 B4D57_bit           _BIT_ACCESS(B4D5,7)
// B4D6<B4D60>
extern volatile __bit                   B4D60               __at(0x7660);	// @ (0xECC * 8 + 0)
#define                                 B4D60_bit           _BIT_ACCESS(B4D6,0)
// B4D6<B4D61>
extern volatile __bit                   B4D61               __at(0x7661);	// @ (0xECC * 8 + 1)
#define                                 B4D61_bit           _BIT_ACCESS(B4D6,1)
// B4D6<B4D62>
extern volatile __bit                   B4D62               __at(0x7662);	// @ (0xECC * 8 + 2)
#define                                 B4D62_bit           _BIT_ACCESS(B4D6,2)
// B4D6<B4D63>
extern volatile __bit                   B4D63               __at(0x7663);	// @ (0xECC * 8 + 3)
#define                                 B4D63_bit           _BIT_ACCESS(B4D6,3)
// B4D6<B4D64>
extern volatile __bit                   B4D64               __at(0x7664);	// @ (0xECC * 8 + 4)
#define                                 B4D64_bit           _BIT_ACCESS(B4D6,4)
// B4D6<B4D65>
extern volatile __bit                   B4D65               __at(0x7665);	// @ (0xECC * 8 + 5)
#define                                 B4D65_bit           _BIT_ACCESS(B4D6,5)
// B4D6<B4D66>
extern volatile __bit                   B4D66               __at(0x7666);	// @ (0xECC * 8 + 6)
#define                                 B4D66_bit           _BIT_ACCESS(B4D6,6)
// B4D6<B4D67>
extern volatile __bit                   B4D67               __at(0x7667);	// @ (0xECC * 8 + 7)
#define                                 B4D67_bit           _BIT_ACCESS(B4D6,7)
// B4D7<B4D70>
extern volatile __bit                   B4D70               __at(0x7668);	// @ (0xECD * 8 + 0)
#define                                 B4D70_bit           _BIT_ACCESS(B4D7,0)
// B4D7<B4D71>
extern volatile __bit                   B4D71               __at(0x7669);	// @ (0xECD * 8 + 1)
#define                                 B4D71_bit           _BIT_ACCESS(B4D7,1)
// B4D7<B4D72>
extern volatile __bit                   B4D72               __at(0x766A);	// @ (0xECD * 8 + 2)
#define                                 B4D72_bit           _BIT_ACCESS(B4D7,2)
// B4D7<B4D73>
extern volatile __bit                   B4D73               __at(0x766B);	// @ (0xECD * 8 + 3)
#define                                 B4D73_bit           _BIT_ACCESS(B4D7,3)
// B4D7<B4D74>
extern volatile __bit                   B4D74               __at(0x766C);	// @ (0xECD * 8 + 4)
#define                                 B4D74_bit           _BIT_ACCESS(B4D7,4)
// B4D7<B4D75>
extern volatile __bit                   B4D75               __at(0x766D);	// @ (0xECD * 8 + 5)
#define                                 B4D75_bit           _BIT_ACCESS(B4D7,5)
// B4D7<B4D76>
extern volatile __bit                   B4D76               __at(0x766E);	// @ (0xECD * 8 + 6)
#define                                 B4D76_bit           _BIT_ACCESS(B4D7,6)
// B4D7<B4D77>
extern volatile __bit                   B4D77               __at(0x766F);	// @ (0xECD * 8 + 7)
#define                                 B4D77_bit           _BIT_ACCESS(B4D7,7)
// B4DLC<B4DLC0>
extern volatile __bit                   B4DLC0              __at(0x7628);	// @ (0xEC5 * 8 + 0)
#define                                 B4DLC0_bit          _BIT_ACCESS(B4DLC,0)
// B4DLC<B4DLC1>
extern volatile __bit                   B4DLC1              __at(0x7629);	// @ (0xEC5 * 8 + 1)
#define                                 B4DLC1_bit          _BIT_ACCESS(B4DLC,1)
// B4DLC<B4DLC2>
extern volatile __bit                   B4DLC2              __at(0x762A);	// @ (0xEC5 * 8 + 2)
#define                                 B4DLC2_bit          _BIT_ACCESS(B4DLC,2)
// B4DLC<B4DLC3>
extern volatile __bit                   B4DLC3              __at(0x762B);	// @ (0xEC5 * 8 + 3)
#define                                 B4DLC3_bit          _BIT_ACCESS(B4DLC,3)
// B4EIDL<B4EID0>
extern volatile __bit                   B4EID0              __at(0x7620);	// @ (0xEC4 * 8 + 0)
#define                                 B4EID0_bit          _BIT_ACCESS(B4EIDL,0)
// B4EIDL<B4EID1>
extern volatile __bit                   B4EID1              __at(0x7621);	// @ (0xEC4 * 8 + 1)
#define                                 B4EID1_bit          _BIT_ACCESS(B4EIDL,1)
// B4EIDH<B4EID10>
extern volatile __bit                   B4EID10             __at(0x761A);	// @ (0xEC3 * 8 + 2)
#define                                 B4EID10_bit         _BIT_ACCESS(B4EIDH,2)
// B4EIDH<B4EID11>
extern volatile __bit                   B4EID11             __at(0x761B);	// @ (0xEC3 * 8 + 3)
#define                                 B4EID11_bit         _BIT_ACCESS(B4EIDH,3)
// B4EIDH<B4EID12>
extern volatile __bit                   B4EID12             __at(0x761C);	// @ (0xEC3 * 8 + 4)
#define                                 B4EID12_bit         _BIT_ACCESS(B4EIDH,4)
// B4EIDH<B4EID13>
extern volatile __bit                   B4EID13             __at(0x761D);	// @ (0xEC3 * 8 + 5)
#define                                 B4EID13_bit         _BIT_ACCESS(B4EIDH,5)
// B4EIDH<B4EID14>
extern volatile __bit                   B4EID14             __at(0x761E);	// @ (0xEC3 * 8 + 6)
#define                                 B4EID14_bit         _BIT_ACCESS(B4EIDH,6)
// B4EIDH<B4EID15>
extern volatile __bit                   B4EID15             __at(0x761F);	// @ (0xEC3 * 8 + 7)
#define                                 B4EID15_bit         _BIT_ACCESS(B4EIDH,7)
// B4SIDL<B4EID16>
extern volatile __bit                   B4EID16             __at(0x7610);	// @ (0xEC2 * 8 + 0)
#define                                 B4EID16_bit         _BIT_ACCESS(B4SIDL,0)
// B4SIDL<B4EID17>
extern volatile __bit                   B4EID17             __at(0x7611);	// @ (0xEC2 * 8 + 1)
#define                                 B4EID17_bit         _BIT_ACCESS(B4SIDL,1)
// B4EIDL<B4EID2>
extern volatile __bit                   B4EID2              __at(0x7622);	// @ (0xEC4 * 8 + 2)
#define                                 B4EID2_bit          _BIT_ACCESS(B4EIDL,2)
// B4EIDL<B4EID3>
extern volatile __bit                   B4EID3              __at(0x7623);	// @ (0xEC4 * 8 + 3)
#define                                 B4EID3_bit          _BIT_ACCESS(B4EIDL,3)
// B4EIDL<B4EID4>
extern volatile __bit                   B4EID4              __at(0x7624);	// @ (0xEC4 * 8 + 4)
#define                                 B4EID4_bit          _BIT_ACCESS(B4EIDL,4)
// B4EIDL<B4EID5>
extern volatile __bit                   B4EID5              __at(0x7625);	// @ (0xEC4 * 8 + 5)
#define                                 B4EID5_bit          _BIT_ACCESS(B4EIDL,5)
// B4EIDL<B4EID6>
extern volatile __bit                   B4EID6              __at(0x7626);	// @ (0xEC4 * 8 + 6)
#define                                 B4EID6_bit          _BIT_ACCESS(B4EIDL,6)
// B4EIDL<B4EID7>
extern volatile __bit                   B4EID7              __at(0x7627);	// @ (0xEC4 * 8 + 7)
#define                                 B4EID7_bit          _BIT_ACCESS(B4EIDL,7)
// B4EIDH<B4EID8>
extern volatile __bit                   B4EID8              __at(0x7618);	// @ (0xEC3 * 8 + 0)
#define                                 B4EID8_bit          _BIT_ACCESS(B4EIDH,0)
// B4EIDH<B4EID9>
extern volatile __bit                   B4EID9              __at(0x7619);	// @ (0xEC3 * 8 + 1)
#define                                 B4EID9_bit          _BIT_ACCESS(B4EIDH,1)
// B4SIDL<B4EXID>
extern volatile __bit                   B4EXID              __at(0x7613);	// @ (0xEC2 * 8 + 3)
#define                                 B4EXID_bit          _BIT_ACCESS(B4SIDL,3)
// B4SIDL<B4EXIDE>
